[
  {
    "page_content": "--- element 1 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 1\",\n  \"content\": \"Terms are expressly rejected by the BUYER and will not become GENERAL TERMS OF PURCHASE YAZAKI  GROUP part of a contractual relationship between the Parties. The Table of Content foregoing shall also apply if the BUYER has not expressly objected or if the BUYER accepts Supplies from the SELLER or pays for such 1. General Principles; Parties ...........................................................1 Supplies without reservation, while being aware of the SELLER's 2. BUYER Customer Requirements; Nominated / Directed Supplies. 1 own general terms and conditions. 3. Purchase Orders; Non-binding Forecasts; Delivery Releases .........1 1.3 The SELLER and the BUYER are independent contracting parties 4. Spare Parts; Discontinuance of Production ....................................2 and nothing in these Terms will make either Party the agent or legal representative of the respective other Party for any purpose 5. Delivery; Scheduling ......................................................................2 whatsoever, nor does it grant either Party any authority to assume 6. Shipping; Packaging .......................................................................2 or to create any obligation on behalf of or in the name of the 7. Ingredients Disclosure; Special Warnings and Instructions ............2 respective other Party. 8. Export Controls; Customs and Origin .............................................2 2. BUYER Customer Requirements; Nominated / Directed Supplies 9. Transfer of Title .............................................................................3 2.1 If (i) a customer of the BUYER (\\\"BUYER Customer\\\") nominates 10. Nonconforming; Rejected or Surplus Supplies ...............................3 and/or directs the BUYER (directly or indirectly) to filename Supplies from the SELLER for a project or (vehicle) programme of such 11. Training .........................................................................................3 BUYER Customer (\\\"BUYER Customer Project\\\"); or (ii) the BUYER 12. BUYER Property .............................................................................3 (directly or indirectly) filenames Supplies from the SELLER for a 13. Work Performed on BUYER's Premises ..........................................3 BUYER Customer or a BUYER Customer Project (without having been so nominated and/or directed by the BUYER Customer), the 14. Tooling; Capital Equipment ...........................................................4 SELLER is obliged to also comply with all requirements, demands 15. Audit Rights; SELLER's Premises .....................................................4 and (change) requests of the BUYER Customer with regard to the 16. SELLER Property ................................................................\"\n}\n\n\n--- element 2 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 2\",\n  \"content\": \"ELLER is obliged to also comply with all requirements, demands 15. Audit Rights; SELLER's Premises .....................................................4 and (change) requests of the BUYER Customer with regard to the 16. SELLER Property ............................................................................4 Supplies for such BUYER Customer (\\\"BUYER Customer Requirements\\\") that (i) are known to the SELLER; (ii) the SELLER 17. Prices; Currency; Payment; Set-off and Recoupment; Invoices .....4 ought to have known; or (iii) the SELLER has been informed of by 18. Taxation.........................................................................................5 the BUYER or the BUYER Customer. 19. Price and Cost Improvements; Competitiveness; Assurance of 2.2 The BUYER Customer Requirements may include, in particular, Performance ..................................................................................5 specific terms and demands with regard to (i) payment and 20. Quality Assurance System .............................................................5 pricing; (ii) delivery and shipping; (iii) packaging and labelling; (iv) spare parts; (v) non-conforming Supplies; (vi) quality 21. Compliance with Law .....................................................................5 requirements; (vii) warranty and limitation periods; (viiii) audit 22. Recall Campaigns ...........................................................................5 rights; (ix) Intellectual Property Rights (as defined in Section 32 23. Product  Warranty; Warranty of Performance ................................5 (Intellectual Property Rights); (x) tooling and capital equipment; or 24. Remedies; Indemnity .....................................................................6 (xi) changes to the BUYER Customer Requirements. 25. Specific Performance .....................................................................6 2.3 The SELLER shall indemnify and hold the BUYER harmless from all (asserted) claims of a BUYER Customer against the BUYER (in 26. Protection against Labour Disruptions; Force Majeure ..................6 particular warranty-, guaranty-, liability- or indemnity claims), 27. Changes .........................................................................................6 which in the BUYER's reasonable opinion stem from Supplies 28. Termination for Cause ...................................................................7 filenamed from the SELLER for a BUYER Customer (\\\"BUYER Customer Claim\\\"); and the BUYER shall have a claim against the 29. Termination for Convenience ........................................................7 SELLER that mirrors the BUYER Customer Claim. 30. Insolvency......................................................................................7 2.4 Subject to the\"\n}\n\n\n--- element 3 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 3\",\n  \"content\": \" Customer Claim\\\"); and the BUYER shall have a claim against the 29. Termination for Convenience ........................................................7 SELLER that mirrors the BUYER Customer Claim. 30. Insolvency......................................................................................7 2.4 Subject to the termination rights of the Parties under these Terms, 31. Transition Support .........................................................................7 the contractual relationship between the Parties shall generally 32. Intellectual Property Rights ...........................................................8 provide for a term corresponding to the BUYER's obligation to be able to provide spare parts for the relevant BUYER Customer 33. Subcontracting ..............................................................................8 Project. The SELLER acknowledges the risk that the BUYER 34. Insurance .......................................................................................8 Customer Project may be cancelled or extended by the BUYER 35. Confidentiality; No Advertising ..................................................... 9 Customer at any time. 36. Non-Assignment ........................................................................... 9 3. Purchase Orders; Non-binding Forecasts; Delivery Releases 37. Governing Law and Jurisdiction ................................................... 9 3.1 The specific contractual relationship between the Parties is governed by individual agreements between the BUYER and the 38. Written Form ............................................................................... 9 SELLER, which are generally executed in the form of Purchase 39. No Waiver .................................................................................... 9 Orders that incorporate these Terms. 40. Severability ..................................................................................10 3.2 \\\"Purchase Order(s)\\\" or \\\"Order(s)\\\" means a specific purchase order, release, or similar document issued by the BUYER to the SELLER for the sourcing of Supplies based on these Terms. 1. General Principles; Nature of the Relationship between the Parties 3.3 To the extent available to the Parties and unless otherwise specified in a Purchase Order, the SELLER will communicate 1.1 The following terms and conditions, in their respective current electronically with the BUYER in a secure (encrypted) manner and version (\\\"Terms\\\") set forth the general principles governing the specifically utilizing electronic data interchange (EDI (Electronic Data Interchange)) with respect sourcing of goods and services (in each case \\\"Supplies\\\") by YAZAKI  to all supply chain communications relating to their contractual Europe Middle East Africa N.V. (Bosstraat 52, 3560 Lummen, relationship, including, in particular, receiving the BUYER's Belgium) and its affiliated companies in EMEA (Europe Middle East Africa) region (in each case production schedules and sending advance shipment notices to the \\\"BUYER\\\"), from suppliers,\"\n}\n\n\n--- element 4 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 4\",\n  \"content\": \"52, 3560 Lummen, relationship, including, in particular, receiving the BUYER's Belgium) and its affiliated companies in EMEA (Europe Middle East Africa) region (in each case production schedules and sending advance shipment notices to the \\\"BUYER\\\"), from suppliers, service providers and business the BUYER. partners (in each case the \\\"SELLER\\\" and together with the BUYER, each a/the \\\"Party/-ies\\\"). 3.4 A Purchase Order incorporating these Terms governs the entire legal relationship between the Parties from quotation to the 1.2 These Terms apply exclusively. The BUYER expressly does not purchase and delivery / provision of Supplies. acknowledge the SELLER terms and conditions and/or (nonmandatory) legal provisions that conflict with these Terms, unless 3.5 These Terms also apply as a framework agreement for future the BUYER has expressly agreed to the validity of such terms or Purchase Orders with the SELLER, whether or not these Terms are provisions in writing. Legal provisions proposed by the SELLER that explicitly referenced in each individual case. are different from or in addition to the provisions set out in these Y-EMEA (Europe Middle East Africa) Internal Ref: Common_PU_2.04_Appendix_General Terms of Purchase Yazaki (Yazaki EMEA) EMEA (Europe Middle East Africa) Group (GToP) 5.4 If the SELLER's acts or omissions result in or are likely to result in 3.6 Projections, forecasts, calculations or estimates stated in a the SELLER's failure to meet the BUYER's delivery requirements Purchase Order constitute a non-binding forecast of demand, and the BUYER requires a more expeditious method of unless expressly stated as firm. The non-binding forecasts are the transportation for the Supplies than the originally agreed BUYER's estimate of the quantities of Supplies it might purchase transportation method (in particular air freight or premium from the SELLER for a given period. Non-binding means that the shipping), the SELLER will be solely responsible for all costs, fees SELLER shall not be entitled to claim payment and acceptance of and (extraordinary) expenses associated with such expedited the forecasted demand by the BUYER, i.e. the forecast is no shipments. commitment to a stated (minimum) volume or commitment. 5.5 If a BUYER Customer, market, economic or other conditions 3.7 If a Purchase Order is labelled as a \\\"Frame-\\\" or \\\"Blanket-\\\" the require a change in delivery schedules, the\"\n}\n\n\n--- element 5 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 5\",\n  \"content\": \") volume or commitment. 5.5 If a BUYER Customer, market, economic or other conditions 3.7 If a Purchase Order is labelled as a \\\"Frame-\\\" or \\\"Blanket-\\\" the require a change in delivery schedules, the BUYER may change the BUYER's obligation to purchase a specific quantity is subject to the rate of scheduled shipments or direct a temporary suspension of issuance of a corresponding \\\"Release-\\\", \\\"Call-off-\\\", or \\\"Spotscheduled shipments without entitling the SELLER to charge \\\"Order by the BUYER specifying the exact fabrication and delivery compensation. details with regard to place, time and quantity. When an Order is labelled as a \\\"Frame Order\\\", the SELLER shall not fabricate or 5.6 If the BUYER requests delivery within a period shorter than the assemble any Supplies nor procure required materials, nor ship agreed lead-time, the SELLER must use its best efforts to meet the any Supplies except to the extent authorised by such written date indicated and immediately notify the BUYER if it believes that Release-, Call-off-, or Spot-Orders. despite such efforts it will be unable to deliver within the requested period. 3.8 In case of \\\"Spot-Orders\\\" the SELLER shall confirm to the BUYER the receipt of the Spot-Order within two \\\"Business Days\\\" (i.e. days 6. Shipping; Packaging on which banks are open for business at the BUYER Location (as 6.1 The SELLER will comply in all respects with the BUYER's shipping defined in Section 37 (Governing Law and Jurisdiction)) in writing and packaging requirements. (e-mail and fax suffices). The Spot-Order will become binding 6.2 Unless agreed otherwise, any charges or costs relating to upon the SELLER five Business Days after receipt. handling, packaging, storage or transportation of Supplies are 3.9 For \\\"Release-Orders\\\" (also referred to as \\\"Call-off Orders\\\") the borne by the SELLER and have been included in the pricing for the BUYER provides to the SELLER the respective ordering schedule Supplies. and forecasts. If the SELLER cannot provide the ordered quantities 6.3 The SELLER will (i) properly pack, mark and ship goods in within the requested periods, the SELLER shall give notice to the accordance with the instructions and requirements of the BUYER BUYER within 48 hours after\"\n}\n\n\n--- element 6 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 6\",\n  \"content\": \"6.3 The SELLER will (i) properly pack, mark and ship goods in within the requested periods, the SELLER shall give notice to the accordance with the instructions and requirements of the BUYER BUYER within 48 hours after receipt of the Call-off Order. and the BUYER Customer, the involved carriers, and laws and Otherwise, the Call-off Order will become binding upon the regulations of the country of manufacture, the country of SELLER upon expiry of such period. For the avoidance of doubt, destination and any country in which the Supplies will be the SELLER shall always comply with the forecasted quantities transported, including, in particular, laws and regulations within the respective forecast period. governing the handling and transportation of dangerous goods or 3.10 The SELLER recognizes that a BUYER Customer may change the hazardous materials (e.g. U.S. Toxic Substances Control Act; purchase orders placed with the BUYER in response to changes in European Union Packaging Directive (94/62/EC); European Union market conditions. The BUYER may, in turn, have to adjust a End of Life Vehicles Directive (2000/53/EC); REACH (Registration, Evaluation, Authorization and Restriction of Chemicals) Regulation Purchase Order to accommodate such requests. As such, the (1907/2006/EC); CLP (Classification, Labeling and Packaging) Regulation (1272/2008/EC); RoHS Directive BUYER specifically reserves the right to increase or decrease any 2011/65/EU; etc); and (ii) include on bills of lading or other quantities stated under any Purchase Order by up to 20% at any shipping documents the correct classification of the Supplies. time prior to final shipment. The SELLER expressly agrees that: 6.4 The marks on each package and identification of the Supplies on (i) it shall provide and sell to the BUYER the additional Supplies packing slips, bills of lading and invoices (when required) must be required by such adjustment within the delivery dates set forth by sufficient to enable the BUYER and the BUYER Customer to easily the BUYER, and (ii) the BUYER shall have no liability to the SELLER identify the Supplies and the corresponding Purchase Order. for Supplies not purchased by the BUYER in accordance with any reduction of Supplies as provided herein. 6.5 The SELLER is obliged to take back packaging at the BUYER's request. 4. Spare Parts; Discontinuance of Production 7. Ingredients\"\n}\n\n\n--- element 7 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 7\",\n  \"content\": \" BUYER in accordance with any reduction of Supplies as provided herein. 6.5 The SELLER is obliged to take back packaging at the BUYER's request. 4. Spare Parts; Discontinuance of Production 7. Ingredients Disclosure; Special Warnings and Instructions The SELLER shall, with regard to BUYER Customer Projects, supply the BUYER with replacement parts, accessory parts, 7.1 The SELLER will promptly furnish to the BUYER in such form and aftermarket parts and/or after sale-service relating to the detail as the BUYER and/or the BUYER Customer may direct: (i) a Supplies (\\\"Spare Parts\\\") at commercially reasonable prices for list of all ingredients and materials in the Supplies; (ii) the amount (i) 15 years after the BUYER's last purchase of the Supplies, or of such ingredients and materials; and (iii) information concerning (ii) 15 years after the end of the vehicle production program of any changes in or additions to such ingredients and materials so the relevant BUYER Customer Project, or (iii) a longer period that the BUYER may comply in a timely manner with all reporting that is required by law in a country where the end-products (in requirements under applicable laws. which the Supplies are used) are sold. The prices shall not 7.2 Prior to and with the shipment of the Supplies, the SELLER agrees exceed the price paid for the last Purchase Order for Supplies to furnish to the BUYER sufficient advance warning and notice, in relating to such Spare Parts. writing (including, in particular, appropriate labels on the 5. Delivery; Scheduling Supplies, containers and packing), of any dangerous goods or hazardous material that is an ingredient or a part of any shipment 5.1 The SELLER will comply in all respects with the BUYER's delivery of Supplies, together with such special handling instructions as and logistics requirements. Time is of the utmost essence, and may be necessary to advise carriers, the BUYER and the BUYER deliveries must be made both in quantities and at times specified Customer of how to exercise that measure of care and precaution by the BUYER. that will comply with any applicable laws or regulations and best 5.2 The BUYER is not obliged to pay for Supplies delivered to the prevent bodily injury or property damage in the handling, BUYER that are in excess of quantities specified/ordered by the transportation, processing, use or disposal\"\n}\n\n\n--- element 8 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 8\",\n  \"content\": \" regulations and best 5.2 The BUYER is not obliged to pay for Supplies delivered to the prevent bodily injury or property damage in the handling, BUYER that are in excess of quantities specified/ordered by the transportation, processing, use or disposal of the Supplies, BUYER. containers and packing shipped to the BUYER or the BUYER 5.3 If the SELLER for any reason anticipates difficulty in complying Customer. with the required delivery date, or in meeting any of the other 8. Export Controls; Customs and Origin requirements of a Purchase Order due to capacity constraints or 8.1 The SELLER agrees to comply with all applicable export control and otherwise, the SELLER shall promptly notify the BUYER in writing sanctions laws, including, in particular the regulations of the of the potential default, the cause thereof, and the estimated United States of America, of member States of the European length of the anticipated default. Y-EMEA (Europe Middle East Africa) Internal Ref: Common_PU_2.04_Appendix_General Terms of Purchase Yazaki (Yazaki EMEA) EMEA (Europe Middle East Africa) Group (GToP) that nonconforming, rejected, obsolete or surplus Supplies are Union, the United Kingdom and any other relevant BUYER not sold as service or replacement parts to third parties. Location (as defined in Section 37 (Governing Law and Jurisdiction)), together the \\\"Export Control Laws\\\". 11. Training 8.2 The SELLER will not violate, and will not cause the BUYER or the 11.1 The SELLER will provide all necessary training and training BUYER Customer to violate, any Export Control Laws (e.g. by materials to the BUYER for the Supplies, at no additional cost to transhipping Supplies through or from sanctioned countries). the BUYER, at the BUYER Location (as defined in Section 37 (Governing Law and Jurisdiction)) (unless another location is 8.3 Licenses or other authorizations required for the export of designated in the Purchase Order). Supplies will be the responsibility of the SELLER, unless otherwise agreed between the Parties in writing, in which case the SELLER 11.2 The SELLER will provide such training in the amount and on such will provide such information as may be requested by the BUYER schedule as may be reasonably required by the BUYER. The SELLER to enable the BUYER to obtain such licenses or authorizations. will provide the training\"\n}\n\n\n--- element 9 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 9\",\n  \"content\": \" in the amount and on such will provide such information as may be requested by the BUYER schedule as may be reasonably required by the BUYER. The SELLER to enable the BUYER to obtain such licenses or authorizations. will provide the training materials in a computerized format, if possible. 8.4 The SELLER will undertake such arrangements as necessary for the Supplies to be covered by any duty deferral or free trade zone 11.3 Where the SELLER obtains the Supplies or a portion of the Supplies program(s) of the country of import. The SELLER will timely and from a third party for resale to the BUYER, the SELLER shall cause accurately provide all information necessary (including written such third party to provide the training contemplated in this documentation and electronic transaction records) to permit the Section. BUYER to (i) receive such benefits or credits; and (ii) satisfy its 12. BUYER Property import and, where required, export customs related obligations, 12.1 All supplies, materials, prototype and production tools, jigs, dies, origin marking or labelling requirements and local content origin gauges, fixtures, moulds, patterns, equipment, related software requirements, if any. and other items (together with any additions, appurtenances, 8.5 The SELLER will ensure compliance with the recommendations or modifications, repairs, refurbishments and replacements thereof) requirements of all applicable authorized economic operators furnished by the BUYER, either directly or indirectly, to the SELLER (AEO), governmental security/anti-terrorism and enhanced for any Supplies, or for which the SELLER has been paid by the border release programs (including, in particular, the European BUYER (\\\"BUYER Property\\\"), will be and remain the property of the Union Customs Union (EUCU), the United States Bureau of BUYER, and all right, title and interest in the BUYER Property will Customs and Border Protection's Customs-Trade Partnership remain with the BUYER, subject only to the limited right of Against Terrorism (C-TPAT), Canada Border Services Agency's possession granted to the SELLER under this Section. Partners in Protection initiative and Administración General de 12.2 At any time, the BUYER will have the right to immediate Aduanas de Mexico's Neuvo Esquema Empressa Certificada possession of the BUYER Property, on the BUYER's demand.\"\n}\n\n\n--- element 10 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 10\",\n  \"content\": \" General de 12.2 At any time, the BUYER will have the right to immediate Aduanas de Mexico's Neuvo Esquema Empressa Certificada possession of the BUYER Property, on the BUYER's demand. If title (NEEC) program). in any BUYER Property has not otherwise passed to the BUYER, 8.6 At the request of the BUYER, the BUYER Customer, or the title will pass to the BUYER immediately upon completion of the competent customs authority, the SELLER will certify its BUYER's PPAP (as defined below in Section 20 (Quality Assurance compliance with the foregoing in writing. System)) process for such property. 9. Transfer of Title 12.3 The SELLER will bear all risk of loss and damage to the BUYER Unless otherwise agreed with the SELLER, title to the Supplies Property. The BUYER Property will (i) at all times be properly will transfer to the BUYER free and clear of any liens, claims, housed and maintained by the SELLER, at its expense; (ii) not be encumbrances, interests or other rights at the moment the risk used by the SELLER for any purpose other than for the of loss transfers from the SELLER to the BUYER with respect to performance of any obligation towards the BUYER; (iii) be such Supplies in accordance with the relevant Incoterm 2020 conspicuously marked by the SELLER as the property of the (\\\"Incoterms\\\") or alternative delivery terms agreed with the BUYER; (iv) not be commingled with the property of the SELLER or SELLER. with that of a third party; (v) not be moved from the SELLER's premises without the BUYER's prior written consent, and (vi) be 10. Nonconforming; Rejected or Surplus Supplies adequately insured against loss or damage for replacement value. 10.1 Prior to any delivery, the Supplies have to be carefully examined 12.4 Upon the request of the BUYER, the BUYER Property will be by the SELLER so that the BUYER and the BUYER Customer can fully immediately released to the BUYER or delivered to the BUYER by rely on their quality and fitness for purpose. The SELLER shall the SELLER in accordance with the requirements of the carrier provide and maintain an\"\n}\n\n\n--- element 11 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 11\",\n  \"content\": \" and the BUYER Customer can fully immediately released to the BUYER or delivered to the BUYER by rely on their quality and fitness for purpose. The SELLER shall the SELLER in accordance with the requirements of the carrier provide and maintain an inspection and process control system selected by the BUYER to transport such BUYER Property; or to acceptable to the BUYER and its Customer covering the Supplies. any location designated by the BUYER, in which event the BUYER Records of all inspection work performed by the SELLER shall be will pay to the SELLER the reasonable additional costs of delivering kept complete, separate and available to the BUYER and its such BUYER Property to such location. Customer during the performance of a Purchase Order and for such longer periods as may be specified in a Purchase Order, but 12.5 To the fullest extent permitted by law, the SELLER waives any not less than ten years after the last delivery of the particular liens, claims, encumbrances, interests or other rights that the Supplies to the BUYER. During the foregoing period, the SELLER SELLER might otherwise have or assert on or with respect to any will retain all pertinent documents, data, records and other of the BUYER Property for work performed on such property or materials pertaining to the Supplies, the SELLER's obligations otherwise. under the Purchase Order, and any payments requested by the 12.6 To the extent any Intellectual Property Rights (as defined in SELLER under the Purchase Order. Section 32 (Intellectual Property Rights)) owned by or licensed to 10.2 The BUYER is not obliged to perform incoming inspections of the the SELLER are embodied in, or are otherwise necessary for the Supplies and the SELLER waives any requirement that the BUYER intended use of, any BUYER Property, the SELLER hereby grants to conducts such inspections. Where mandatory law requires the the BUYER a fully paid, irrevocable, non-exclusive, worldwide, BUYER to perform incoming inspections, such incoming perpetual to the maximum extent permitted by law, royalty-free inspections shall be limited to externally visibly transportation license, with the right to grant sublicenses as necessary for any damages. use of the BUYER Property, to use such Intellectual Property Rights. 10.3 Payment for nonconforming Supplies will not constitute an acceptance of them, limit or impair the BUYER's right to assert any 13.\"\n}\n\n\n--- element 12 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 12\",\n  \"content\": \" for any damages. use of the BUYER Property, to use such Intellectual Property Rights. 10.3 Payment for nonconforming Supplies will not constitute an acceptance of them, limit or impair the BUYER's right to assert any 13. Work Performed on BUYER's Premises legal or equitable remedy, or relieve the SELLER's responsibility for 13.1 If the SELLER performs any work on the BUYER's premises or latent defects. utilizes the property of the BUYER or of a BUYER Customer, the 10.4 Any Supplies (i) rejected by the BUYER as nonconforming; or SELLER will examine these premises/that property to determine (ii) that become obsolete or surplus, will be rendered unusable whether they are safe for the requested Supplies and will advise prior to salvage or disposal by the SELLER. The SELLER will ensure Y-EMEA (Europe Middle East Africa) Internal Ref: Common_PU_2.04_Appendix_General Terms of Purchase Yazaki (Yazaki EMEA) EMEA (Europe Middle East Africa) Group (GToP) 14.12 To the extent permitted by applicable law, any payments made by the BUYER promptly of any situation the SELLER deems to be the BUYER for the BUYER-owned Tooling are expressly intended unsafe. by the SELLER to be held in trust for the benefit of any 13.2 If the SELLER performs any work on the BUYER's premises or utilizes subcontractor(s) used by the SELLER to produce the BUYER-owned the property of the BUYER, whether on or off the BUYER's Tooling that are covered by such payments and the SELLER agrees premises, the SELLER will indemnify and hold the BUYER harmless to hold such payments as trustee in express trust for such from and against any liability, claims, demands or expenses subcontractors until the SELLER has paid the subcontractors in full (including, in particular, legal and other professional fees) for for the BUYER-owned Tooling. damages to the BUYER Property, or injuries or death to the 15. Audit Rights; SELLER's Premises BUYER's or the SELLER's employees, subcontractors or any other person arising from or in connection with the SELLER's 15.1 The SELLER grants the BUYER access to its premises and books and performance of work or use of the BUYER Property, except for records\"\n}\n\n\n--- element 13 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 13\",\n  \"content\": \" subcontractors or any other person arising from or in connection with the SELLER's 15.1 The SELLER grants the BUYER access to its premises and books and performance of work or use of the BUYER Property, except for records solely for the purpose of auditing the SELLER's compliance such liability, claim or demand arising out of the sole negligence with these Terms or inspecting or conducting an inventory of of the BUYER. finished Supplies, work-in-progress, raw materials, any of the BUYER Property and all work or other items to be provided 14. Tooling; Capital Equipment pursuant to the contractual relationship with the BUYER located 14.1 This Section applies only to Orders for tooling and/or capital at the SELLER's premises. equipment. 15.2 The SELLER will cooperate with the BUYER in order to facilitate 14.2 All tools and capital equipment are to be made to the BUYER's BUYER's audit, including, in particular, by segregating and specifications (or, where directed by the BUYER, to those of the promptly producing such records as the BUYER may reasonably BUYER Customer). request, and otherwise making records and other materials 14.3 Any exception to such specifications must be agreed upon in accessible to the BUYER. The SELLER will preserve all records writing. To the extent an Order expressly states that it is for pertinent to its contractual relationship with the BUYER. \\\"tooling\\\" or \\\"capital equipment\\\" and unless otherwise stated in 15.3 Any such audit or inspection conducted by the BUYER or its the Order, freight terms are DDP Incoterms BUYER's facility. representatives will not constitute acceptance of any Supplies 14.4 All right, title, and interest in and to any part of tooling to be paid (whether in progress or finished), relieve the SELLER of any liability for by the BUYER (\\\"BUYER-owned Tooling\\\") shall pass to the or prejudice any rights or remedies available to the BUYER. BUYER as soon as it is acquired or fabricated in accordance with a 16. SELLER Property Purchase Order. The SELLER acknowledges and agrees that the 16.1 Unless otherwise agreed, the SELLER, at its expense, will furnish, BUYER takes title to the BUYER-owned Tooling even if the SELLER keep in good condition, and replace when necessary all has not yet\"\n}\n\n\n--- element 14 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 14\",\n  \"content\": \" 16.1 Unless otherwise agreed, the SELLER, at its expense, will furnish, BUYER takes title to the BUYER-owned Tooling even if the SELLER keep in good condition, and replace when necessary all has not yet been paid therefor. During the term of the respective machinery, equipment, tools, jigs, dies, gauges, fixtures, moulds, Purchase Order, all such BUYER-owned Tooling in the possession patterns and other items (\\\"SELLER Property\\\") necessary for the of the SELLER shall be deemed (i) the BUYER Property; or – to the Supplies. extent this is not possible under applicable law; (ii) bailed property of the BUYER and shall not be deemed a fixture or a part of the 16.2 The SELLER grants the BUYER an irrevocable option to take SELLER's (real) property. possession of and title to the SELLER Property that is used exclusively for the production of the Supplies upon payment to 14.5 The SELLER will properly house and maintain the BUYER-owned the SELLER of its net book value less any amounts that the BUYER Tooling in accordance with Section 12 (BUYER Property). The has previously paid to the SELLER for the cost of such items, but SELLER shall indemnify the BUYER against any claim adverse to the less any amounts owed by the SELLER to the BUYER; provided, BUYER's ownership of the BUYER-owned Tooling, except as such however, that (i) this option will not apply if the SELLER Property claims may result from any acts or omissions of the BUYER. is used to produce goods that are the standard stock of the SELLER 14.6 To the extent permitted by law, the SELLER waives its right to or if a substantial quantity of these goods are being sold by the object to the repossession of the BUYER-owned Tooling by the SELLER to third parties, and (ii) this option may only be exercised BUYER in the event the SELLER is insolvent or in bankruptcy in connection with a termination of the contractual relationship proceedings. between the Parties under Section 28 (Termination for Cause) or 14.7 While in its possession, the SELLER, at the SELLER's expense, shall Section 30 (Insolvency). maintain\"\n}\n\n\n--- element 15 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 15\",\n  \"content\": \" the contractual relationship proceedings. between the Parties under Section 28 (Termination for Cause) or 14.7 While in its possession, the SELLER, at the SELLER's expense, shall Section 30 (Insolvency). maintain the BUYER-owned Tooling in first class condition and 17. Prices; Currency; Payment; Set-off and Recoupment; Invoices immediately replace any items which are lost or destroyed or 17.1 If not agreed otherwise, the price for each shipment of Supplies become worn out. All repaired or replaced BUYER-owned Tooling delivered by the SELLER to the BUYER, in accordance with these shall be the property of the BUYER. Wear and tear and repairs of Terms, is due and payable by the BUYER according to following the BUYER-owned Tooling is the SELLER's responsibility. Title to options: any modifications, changes or accessions to the BUYER-owned Tooling shall vest in the BUYER regardless of whether the BUYER up to 30 days from receipt of invoice: -2%; has reimbursed the SELLER for such modifications, changes or up to 60 days from receipt of invoice: -1%; or accessions. up to 90 days from receipt of invoice: net. 14.8 The SELLER shall keep such records in relation to the BUYER17.2 The Price and payment terms stated in the Purchase Order are owned Tooling as the BUYER may reasonably require. None of the binding. BUYER-owned Tooling shall be used in the production, manufacture or design of any supplies or materials except for 17.3 Each billing document (for example invoice or credit note, etc.) Supplies for the BUYER. from the SELLER to the BUYER must comply with applicable law and the Yazaki (Yazaki EMEA) Invoicing Requirements. The latest version of the 14.9 The SELLER shall not sell or otherwise dispose of any product using Yazaki (Yazaki EMEA) Invoicing Requirements is available on this link: Supplier  the BUYER-owned Tooling to any third party except where Yazaki (Yazaki EMEA) Europe (yazaki-europe.com) specifically so authorized by the BUYER in writing. 17.4 The BUYER may reject any invoice that is inaccurate or does not 14.10 If the BUYER-owned Tooling is not utilized to produce any Supplies conform to these requirements, and the SELLER will promptly for the BUYER for a period of\"\n}\n\n\n--- element 16 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 16\",\n  \"content\": \" BUYER may reject any invoice that is inaccurate or does not 14.10 If the BUYER-owned Tooling is not utilized to produce any Supplies conform to these requirements, and the SELLER will promptly for the BUYER for a period of two years, the SELLER shall notify the reissue any such rejected invoice. The BUYER's failure to reject an BUYER accordingly and request instructions as to the disposition invoice does not constitute the BUYER's acceptance of the invoice of the BUYER-owned Tooling. or the Supplies to which such invoice pertains. 14.11 If the SELLER subcontracts (subject to Section 33 (Subcontracting)) 17.5 Unless a Purchase Order specifically states otherwise, all all or any portion of the manufacture of the BUYER-owned payments for the Supplies shall be made in the local currency of Tooling, the SELLER is obliged to obtain for the BUYER all of the the SELLER's manufacturing location for the goods or in the case rights contained in this Section from each such subcontractor. Y-EMEA (Europe Middle East Africa) Internal Ref: Common_PU_2.04_Appendix_General Terms of Purchase Yazaki (Yazaki EMEA) EMEA (Europe Middle East Africa) Group (GToP) the Automotive Industry, including in particular ISO9001 of services, in the local currency of the SELLER's location from certification as a minimum, IATF16949 quality certification, ISO (International Organization for Standardization) which the services are provided. 45001 health and safety certification and ISO (International Organization for Standardization) 14001 17.6 Payments may also be made electronically (including, in environmental certification including registration, and any particular, by bank transfer) or recorded bill of exchange. Where amendments, supplements and/or successor programs thereto. BUYER has reasonable grounds to believe that Supplies provided 21. Compliance with Law by the SELLER are subject to any liens, claims or encumbrances, BUYER may withhold payment pending receipt of evidence, in 21.1 The SELLER, and any Supplies, will comply with all applicable laws, such form and detail as BUYER may direct, that such Supplies are rules, regulations, orders, conventions, ordinances or standards of free of any liens, claims and encumbrances. the country(ies) of production and destination or that relate to the manufacture, labelling, transportation, importation, exportation, 17.7 In addition to any right of set-off or recoupment provided by\"\n}\n\n\n--- element 17 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 17\",\n  \"content\": \" encumbrances. the country(ies) of production and destination or that relate to the manufacture, labelling, transportation, importation, exportation, 17.7 In addition to any right of set-off or recoupment provided by law, licensing, approval or certification of the Supplies, including, in all amounts due to the SELLER will be considered net of particular, those relating to environmental matters, the handling indebtedness of the SELLER and its affiliates to the BUYER and its and transportation of dangerous goods or hazardous materials, affiliates; and the BUYER will have the right, with regard to data protection and privacy (in particular the EU General Data payments due to the SELLER, to set-off against or to recoup from Protection Regulation 2016/679), (minimum) wages, hours and any amounts due to the SELLER and its affiliates from the BUYER conditions of employment, subcontractor selection, and its affiliates. discrimination, occupational health/safety and motor vehicle 18. Taxation safety, including, in particular the National Traffic and Motor 18.1 Unless otherwise agreed between the Parties, the prices agreed Vehicle Safety Act, United States motor vehicle safety standards with the SELLER for the Supplies will be exclusive of all and European Union Directive 2000/53/EC, as well as all transactional taxes, including any sales, use, excise, services, value legislation as stated in BUYER’s “Supplier  Quality Manual”. added tax, goods and services tax, or similar tax, and these 21.2 The SELLER guarantees that neither it nor any of its transactional taxes should be separately identified by the SELLER subcontractors, vendors, agents or other associated third parties in both the SELLER's quote and in the Purchase Order, even if the will utilize child, slave, prisoner or any other form of forced or tax rate is zero. The BUYER will not be responsible for any involuntary labour, or engage in abusive employment or corrupt transactional taxes charged by the SELLER that are not identified business practices. in this manner. 21.3 The SELLER shall comply with all applicable anti-corruption laws, 18.2 The SELLER shall separately state all charges for transactional including, in particular, the United States Foreign Corrupt taxes on its invoices and/or other relevant documents. Practices Act and the United Kingdom Bribery Act; and neither it Additionally,\"\n}\n\n\n--- element 18 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 18\",\n  \"content\": \".2 The SELLER shall separately state all charges for transactional including, in particular, the United States Foreign Corrupt taxes on its invoices and/or other relevant documents. Practices Act and the United Kingdom Bribery Act; and neither it Additionally, the SELLER shall provide the BUYER with invoices in nor any of its subcontractors, vendors, agents or other associated line with the applicable tax laws in the relevant country to enable third parties will engage in any form of commercial bribery, nor the BUYER to reclaim the transactional taxes and the SELLER will directly or indirectly provide or offer to provide, anything of value provide such documentation as soon as practicable. to or for the benefit of, any official or employee of a governmental 18.3 The SELLER is responsible for remitting the transactional tax to the authority or of any government-owned, government-controlled applicable taxing authority except for those states or jurisdictions or government-affiliated entity to obtain or retain any contract, where the BUYER has provided the SELLER with an appropriate business opportunity or other business benefit, or to influence any exemption certificate. The SELLER will use reasonable efforts to act or decision of such a person in his/her official capacity. apply for such exemptions where applicable. 21.4 The SELLER warrants and guarantees that it has not received or 18.4 The SELLER will not charge the BUYER for any transactional taxes been offered any illegal or improper bribe, kickback, payment, charged by its subcontractors. gift, or similar material gratuity from a BUYER representative, employee or agent. 19. Price and Cost Improvements; Competitiveness; Assurance of Performance 21.5 At the BUYER's request, the SELLER will certify in writing its compliance with the foregoing and will report any breach or 19.1 The SELLER must remain competitive and shall continuously work violation of this Section immediately to the BUYER Legal & on decreasing its production costs according to the standards and Compliance Department at compliance@yazaki-europe.com. developments in the automotive industry. 21.6 The SELLER will indemnify and hold the BUYER harmless from and 19.2 If the SELLER has negotiated commercial terms directly with a against any liability, claims, demands or expenses (including, in BUYER Customer for Supplies to be filenamed by the BUYER from particular, legal or other professional fees) arising from or relating\"\n}\n\n\n--- element 19 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 19\",\n  \"content\": \" If the SELLER has negotiated commercial terms directly with a against any liability, claims, demands or expenses (including, in BUYER Customer for Supplies to be filenamed by the BUYER from particular, legal or other professional fees) arising from or relating the SELLER for a BUYER Customer Project, the SELLER is obliged to to the SELLER's noncompliance with this Section 21. immediately (i) notify the BUYER of any price adjustments with regard to the Supplies agreed between the SELLER and the BUYER 22. Recall Campaigns Customer; and (ii) reflect any price reductions in its contractual In the event either Party believes it may be necessary to conduct relationship with the BUYER, provided that any price increases a recall, field correction, market withdrawal, stock recovery or require the BUYER's prior written consent in order to become similar action with respect to any Supplies which were sold under effective. these Terms (\\\"Recall Campaign\\\"), or in the event a BUYER 19.3 In the event that the BUYER has reasonable grounds for doubts Customer, or governmental body / authority informs one of the with respect to the SELLER's continued contractual performance, Parties of its belief that a Recall Campaign might be necessary, the the BUYER may, in writing, demand adequate assurance of such Parties shall promptly consult with each other as to how best to performance from the SELLER. proceed, it being understood and agreed that the final decision as to any Recall Campaign of any Supplies shall be made by the 20. Quality Assurance System BUYER; provided, however, that neither Party shall be prohibited 20.1 The SELLER will comply in all respects with the BUYER's quality hereunder from taking any action that is required under requirements and procedures, as well as with all applicable applicable law. industry standards. The SELLER will meet the full requirements of the relevant Production Part Approval Processes (\\\"PPAP (Production Part Approval Process)\\\") as 23. Product  Warranty; Warranty of Performance specified by the BUYER, including IMDS (International Material Data System) data submission to Yazaki (Yazaki EMEA) 23.1 The SELLER warrants and guarantees that the Supplies will Europe company ID: 223417. conform to all specifications, drawings, samples, descriptions and 20.2 The SELLER will promote continuous improvement in the quality quality standards furnished by the BUYER or a BUYER Customer, of the Supplies and the SELLER's manufacturing and logistics or furnished by the SELLER\"\n}\n\n\n--- element 20 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 20\",\n  \"content\": \", descriptions and 20.2 The SELLER will promote continuous improvement in the quality quality standards furnished by the BUYER or a BUYER Customer, of the Supplies and the SELLER's manufacturing and logistics or furnished by the SELLER and approved by the BUYER in writing, processes. and will be merchantable, free from any defects in design, 20.3 The SELLER shall maintain a quality assurance system in line with material and workmanship and free from any third party rights the most recent versions of Management Systems standards of and in compliance with all applicable laws. Y-EMEA (Europe Middle East Africa) Internal Ref: Common_PU_2.04_Appendix_General Terms of Purchase Yazaki (Yazaki EMEA) EMEA (Europe Middle East Africa) Group (GToP) 25. Specific Performance 23.2 The SELLER acknowledges that it knows of the BUYER's intended use of the Supplies and warrants and guarantees that the Supplies The SELLER acknowledges and agrees that monetary damages will have been selected, designed, manufactured and assembled by not always be a sufficient remedy for any actual or threatened the SELLER based upon the BUYER's stated use and will be fit and breach by the SELLER and that, in addition to all other rights and sufficient for the particular purposes intended by the BUYER or remedies that the BUYER may have, the BUYER will be entitled to the BUYER Customers. specific performance and temporary, preliminary and permanent injunctive relief in connection with any action to enforce its rights, 23.3 Unless otherwise set forth in these Terms, the duration of the without any requirement of a bond or other security to be warranty provided by the SELLER to the BUYER for the Supplies provided by the BUYER. will begin on the date of receipt of the Supplies by the BUYER and end on the later of (i) the date of expiration of any warranty period 26. Protection against Labour Disruptions; Force Majeure provided under applicable law for the respective Supplies; (ii) the 26.1 The SELLER will, at its own expense, take such actions as are expiration of any warranty period applicable to the Supplies necessary or appropriate to ensure the uninterrupted supply of provided by the BUYER to the BUYER Customer for the end- goods and services to the BUYER for not less than 25 Business Days product into which the Supplies are incorporated; or (iii) the during any foreseeable or anticipated labour disruption and/or expiration of any specific\"\n}\n\n\n--- element 21 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 21\",\n  \"content\": \" to the BUYER Customer for the end- goods and services to the BUYER for not less than 25 Business Days product into which the Supplies are incorporated; or (iii) the during any foreseeable or anticipated labour disruption and/or expiration of any specific warranty period or performance the expiration of any of the SELLER's labour contracts. standard provided in any document incorporated by reference to 26.2 Any delay or failure of either Party to perform its obligations these Terms, including in the BUYER's (or the BUYER Customers') towards the respective other Party will be excused to the extent specifications or quality standards (including, in particular, the that (i) the SELLER is unable to produce, sell or deliver; or (ii) the quality assurance systems referred to in Section 20 (Quality BUYER is unable to accept delivery, buy or use, the Supplies, as the Assurance System)). In no event shall the warranty period be less result of an event or occurrence beyond the reasonable control of than 48 months starting from the date of receipt of the Supplies such Party, without such Party's fault or negligence (a \\\"Force by the BUYER. Majeure Event\\\"), including, if applicable, actions by any 24. Remedies; Indemnity governmental authority (whether valid or invalid), fires, floods, 24.1 The rights and remedies reserved to the BUYER in its contractual windstorms, explosions, riots, natural disasters, epidemics or relationship with the SELLER are cumulative with, and additional pandemics, wars and sabotage; provided that written notice of to, all other rights and remedies of the BUYER under applicable such Force Majeure Event (including the anticipated duration of law. the delay) must be given by the affected Party to the respective other Party as soon as possible (but in no event more than five 24.2 If any of the Supplies are found at any time to be defective in Business Days after the Force Majeure Event occurs). A Force design, material or workmanship, or otherwise not in conformity Majeure Event shall also be deemed to exist in case that any such with the requirements of a Purchase Order, the BUYER, in addition events occur at BUYER’s Customers. to such other rights, remedies and choices as it may have under a Purchase Order or by law, at its option and sole discretion may: 26.3 During any Force Majeure Event affecting the SELL\"\n}\n\n\n--- element 22 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 22\",\n  \"content\": \" occur at BUYER’s Customers. to such other rights, remedies and choices as it may have under a Purchase Order or by law, at its option and sole discretion may: 26.3 During any Force Majeure Event affecting the SELLER's (i) reject and return such Supplies at the SELLER's expense; and/or performance, the BUYER may, at its option, filename Supplies from (ii) require the SELLER to inspect the Supplies and remove and other filenames and reduce the deliveries filenamed from the SELLER replace nonconforming Supplies with Supplies that conform to a accordingly, without liability to the SELLER, or require the SELLER Purchase Order. If the SELLER fails to promptly make the to provide Supplies from other filenames in quantities and at times necessary inspection, removal and/or replacement, the BUYER requested by the BUYER at the price agreed between the Parties may at its option and the SELLER's cost, inspect and repair or for such Supplies. replace the Supplies. 26.4 The SELLER will use all diligent efforts to ensure that the effects of 24.3 Without limiting the foregoing, in the event that any Supplies fail any Force Majeure Event are minimized and, as promptly as to conform to the warranties set forth in these Terms or the possible, resume full performance towards the BUYER. If product specifications agreed between the Parties, or if the requested by the BUYER in writing, the SELLER will, within three SELLER otherwise breaches any of its obligations under its Business Days after the BUYER's request, provide adequate contractual relationship with the BUYER, the BUYER will be assurances that the delay in the SELLER's performance resulting entitled to recover from the SELLER any and all damages, from such event will not exceed 25 Business Days. If the delay lasts including, in particular, any direct, indirect, incidental and more than 25 Business Days or the SELLER does not provide such consequential damages and all legal and other professional fees adequate assurances, the BUYER may immediately terminate its and costs incurred by the BUYER as a result of such breach or contractual relationship with the SELLER without liability to the failure, including, in particular, costs, fees, (extraordinary) SELLER. expenses and losses incurred by the BUYER (i) in inspecting, 27. Changes sorting, testing, repairing or replacing nonconforming Supplies\"\n}\n\n\n--- element 23 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 23\",\n  \"content\": \" the failure, including, in particular, costs, fees, (extraordinary) SELLER. expenses and losses incurred by the BUYER (i) in inspecting, 27. Changes sorting, testing, repairing or replacing nonconforming Supplies; 27.1 By written notice to the SELLER, the BUYER and/or the BUYER (ii) resulting from production interruptions; (iii) in conducting Customer may, from time to time, direct changes, or direct the Recall Campaigns or other corrective service actions; (iv) resulting SELLER to make changes to the scope of the Supplies, including, in from personal injury and death, (v) property damage; or (vi) in the particular, with respect to such matters as inspection, testing or transitioning of the sourcing of the Supplies from the Seller to a quality control, and the Parties will promptly discuss, reasonably third party. The SELLER will indemnify and hold the BUYER and in good faith, any pricing adjustments (up or down) to be harmless in respect of all costs, fees, (extraordinary) expenses, made in connection with such changes. Notwithstanding any such losses, liabilities, claims and any other obligations resulting from discussions, the SELLER will immediately implement such changes such breach or failure, in particular warranty and product liability as directed by the BUYER. claims, costs of Recall Campaigns and other corrective service actions that, in the BUYER's or the affected BUYER Customers' 27.2 In the event that the Parties are unable to reach an agreement on reasonable judgment, are required to rectify non-conformities in any pricing adjustments to be made in connection with such the Supplies that are the result of a breach of the foregoing changes, any difference in price or time for performance resulting warranty, whether such Recall Campaigns are mandated by any from such changes will be equitably adjusted by the BUYER based governmental entity, by the BUYER Customers or by the BUYER. on a fair cost assessment after receipt of documentation in such form and detail as the BUYER may direct. The SELLER will accept 24.4 In cases of liability depending upon culpability, however, this only any amendments issued by the BUYER implementing such applies if the SELLER is at fault. Insofar as the cause of the damage changes. lies within the SELLER's sphere of responsibility, the SELLER bears the burden of proof that it is\"\n}\n\n\n--- element 24 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 24\",\n  \"content\": \" issued by the BUYER implementing such applies if the SELLER is at fault. Insofar as the cause of the damage changes. lies within the SELLER's sphere of responsibility, the SELLER bears the burden of proof that it is not at fault. 27.3 The SELLER may not (i) relocate the production, manufacture or assembly of the Supplies from the facilities approved by the BUYER; (ii) change the location from which the Supplies are Y-EMEA (Europe Middle East Africa) Internal Ref: Common_PU_2.04_Appendix_General Terms of Purchase Yazaki (Yazaki EMEA) EMEA (Europe Middle East Africa) Group (GToP) the aggregate price payable by the BUYER for Supplies that would shipped; or (iii) change the manufacturing process of the Supplies have been produced or performed by the SELLER under the or the SELLER Property for Supplies without the prior written BUYER's delivery schedules outstanding at the date of consent of the BUYER. termination. 28. Termination for Cause 29.8 Except as expressly provided in this Section, the BUYER will not be 28.1 The BUYER may terminate all or any part of its contractual liable for and will not be required to make payments to the relationship with the SELLER, without liability to the SELLER, if the SELLER, directly or on account of claims by the SELLER's SELLER (i) breaches any term of its contractual relationship with subcontractors, for loss of anticipated profit, overhead, interest, the BUYER (including, in particular, the SELLER's warranties under facilities and equipment rearrangement costs or rental, Section 23 (Product  Warranty; Warranty of Performance); unamortized depreciation costs, or general and administrative (ii) states its intention not to perform or otherwise rejects any of burden charges from termination of the contractual relationship. its contractual obligations towards the BUYER; or (iii) fails to make The payment specified in this Section is the SELLER's sole remedy progress in performance so as to endanger timely and proper for termination. supply; provided, however, that if any failure or breach under the 30. Insolvency foregoing (i) through (iii) is curable, the BUYER will provide the SELLER an opportunity to cure within a commercially reasonable 30.1 The BUYER may immediately terminate its contractual period of time under the circumstances; such period of time shall relationship with the SELLER,\"\n}\n\n\n--- element 25 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 25\",\n  \"content\": \"able, the BUYER will provide the SELLER an opportunity to cure within a commercially reasonable 30.1 The BUYER may immediately terminate its contractual period of time under the circumstances; such period of time shall relationship with the SELLER, without liability to the SELLER, in any in no case exceed five Business Days after the BUYER provides one or more of the following or other comparable events: notice of the failure or breach to the SELLER. (i) insolvency of the SELLER (including, in particular, a circumstance in which the SELLER's liabilities exceed its assets or 28.2 In addition, the BUYER may terminate all or any part of its the SELLER is unable to pay its debts as they come due); contractual relationship with the SELLER upon giving at least 20 (ii) appointment of a receiver, trustee or administrator over the Business Days prior written notice to the SELLER, without liability SELLER or its assets; or (iii) execution of an assignment for the to the SELLER, if a direct or indirect change in control or ownership benefit of creditors by the SELLER, provided that such petition, of the SELLER occurs. appointment or assignment is not vacated or nullified within ten 29. Termination for Convenience Business Days of such event. 29.1 In addition to any other rights of the BUYER to terminate its 30.2 The SELLER will inform the BUYER immediately should any of these contractual relationship with the SELLER, the BUYER may, at its events occur or the SELLER becomes aware of events or sole discretion, terminate all or any part of the contractual circumstances likely to give rise to any such events. relationship, at any time and for any reason, by giving written 30.3 The SELLER shall reimburse the BUYER for all costs and expenses notice to the SELLER. incurred by the BUYER in connection with any of these events 29.2 In the event the BUYER exercises its right to terminate for (regardless of whether the BUYER exercises its termination rights convenience under this Section, and, unless otherwise agreed, the with respect thereto, including, in particular, all legal or other BUYER will pay to the SELLER only the following amounts, without professional fees, as well as costs for Transition Support under duplication: (i) the contract price for all Supplies\"\n}\n\n\n--- element 26 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 26\",\n  \"content\": \" respect thereto, including, in particular, all legal or other BUYER will pay to the SELLER only the following amounts, without professional fees, as well as costs for Transition Support under duplication: (i) the contract price for all Supplies that have been Section 31 (Transition Support) as applicable). Section 24.3 completed in accordance with the relevant agreement and not (Indemnity; Warranty) shall apply accordingly. previously paid for; and (ii) the actual costs of work-in-progress 31. Transition Support and raw materials incurred by the SELLER in manufacturing / furnishing the Supplies, to the extent such costs are reasonable in 31.1 Upon the BUYER's request to change to an alternative filename of amount and are properly allocable or apportionable under the Supplies (\\\"New Supplier \\\"), the SELLER is obliged to cooperate generally accepted accounting principles to the terminated in the transition to such New Supplier  and to provide, in particular, portion of the contractual relationship; less, however, the sum of the following \\\"Transition Support\\\": (i) the SELLER will continue the reasonable value or cost (whichever is higher) of any goods or production and delivery of all Supplies as ordered by the BUYER, materials used, sold or scrapped by the SELLER with the BUYER's on the unaltered (commercial) terms stated in the respective prior written consent and the cost of any damaged or destroyed Purchase Order, without premium or other condition, during the goods or material. entire period reasonably required by the BUYER and/or the New Supplier  to complete the transition to the New Supplier , such that 29.3 The SELLER will promptly make available for delivery to the the SELLER's action or inaction causes no interruption in the BUYER, as specified by the BUYER, any Supplies completed but not BUYER's ability to obtain the Supplies as needed; (ii) at no cost to delivered as of the time of the BUYER's termination hereunder. the BUYER, the SELLER will promptly provide all requested Any request for payment submitted to the BUYER under this information, documentation and access to the SELLER's Section must include sufficient supporting data to permit an audit manufacturing process, including on-site inspections, bill-ofby the BUYER (in accordance with Section 15 (Audit Rights; material data, tooling and process detail and samples of the SELLER's Premises), including,\"\n}\n\n\n--- element 27 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 27\",\n  \"content\": \" to permit an audit manufacturing process, including on-site inspections, bill-ofby the BUYER (in accordance with Section 15 (Audit Rights; material data, tooling and process detail and samples of the SELLER's Premises), including, in particular, such supplemental Supplies and components; and (iii) subject to the SELLER's and supporting information as the BUYER may request. reasonable capacity constraints, the SELLER will provide special 29.4 Any request for payment under this Section must be in writing and overtime production, storage and/or management of extra include, in particular, a statement setting forth the contract price inventory of the Supplies, extraordinary packaging and for the Supplies, invoices reflecting the actual cost of work-in- transportation and other special services as requested by the progress and raw materials, the basis for the allocation of such BUYER. costs to the terminated portion of the contractual relationship, 31.2 In the event of a termination for convenience under Section 29 and any other supporting documentation reasonably requested (Termination for Convenience), the BUYER will reimburse the by the BUYER. SELLER for the actual reasonable costs and expenses incurred (and 29.5 Any amount otherwise due to the SELLER pursuant to this Section estimated in advance) by the SELLER for the Transition Support, will be reduced by any amount owed by the SELLER to the BUYER. against adequate evidence and upon a corresponding invoice. 29.6 Any payment under this Section will not be deemed a waiver of Section 17 (Prices; Currency; Payment; Set-off and Recoupment; any of the BUYER's other contractual and/or statutory rights. Invoices) shall apply accordingly. 29.7 Notwithstanding any other provision in these Terms, the BUYER 31.3 In the event of a termination by the SELLER or a termination for will make no payments under this Section for finished goods, cause under Section 28 (Termination for Cause), the SELLER shall services, work-in-progress or raw materials fabricated or procured bear all costs and expenses for the Transition Support. Section by the SELLER in amounts in excess of those authorized in the 24.3 (Indemnity; Warranty) shall apply accordingly. BUYER's delivery schedules or any undelivered goods that are in the SELLER's standard stock or that are readily marketable. Further, any payments made under this Section will not exceed\"\n}\n\n\n--- element 28 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 28\",\n  \"content\": \"Indemnity; Warranty) shall apply accordingly. BUYER's delivery schedules or any undelivered goods that are in the SELLER's standard stock or that are readily marketable. Further, any payments made under this Section will not exceed Y-EMEA (Europe Middle East Africa) Internal Ref: Common_PU_2.04_Appendix_General Terms of Purchase Yazaki (Yazaki EMEA) EMEA (Europe Middle East Africa) Group (GToP) (ii) in the event the SELLER is unable to provide Supplies as a result 32. Intellectual Property Rights of a Force Majeure Event, but in such event only for the duration 32.1 This Section will apply where the Parties have not entered into a of the SELLER's inability to supply. separate agreement with respect to the Parties' Intellectual 32.8 To the extent that the BUYER issues Purchase Orders for the Property Rights (as defined below) that expressly prevails over creation of copyrightable works, these works will be considered these Terms. \\\"works made for hire\\\" for the BUYER except to the extent that the 32.2 \\\"Intellectual Property Rights\\\" means any patents, patented works do not qualify as \\\"works made for hire\\\" for the BUYER, in articles, patent applications, designs, industrial designs, which case the SELLER hereby assigns to the BUYER, to the extent copyrights, software, filename code, database rights, moral rights, permitted under applicable law, all right, title and interest in all inventions whether or not capable of protection by patent or copyrights and if lawfully permitted waives all moral rights registration, techniques, technical data, trade secrets, know-how, therein. and any other proprietary right, whether registered or 32.9 For the avoidance of doubt, the BUYER, its affiliates, its unregistered, including applications and registrations thereof, all subcontractors and BUYER Customers have the right to repair, related and continuing rights, and all similar or equivalent forms reengineer, reconstruct, remanufacture, or rebuild the specific of protection anywhere in the world. Supplies delivered by the SELLER without payment of any royalty 32.3 Intellectual Property Rights excludes all brands, trademarks, trade to the SELLER. names, slogans and logos of the SELLER and the BUYER unless 32.10 Supplies manufactured based on the BUYER's drawings, designs, specifically identified as a deliverable or work product of the and/or specifications as well as any software code\"\n}\n\n\n--- element 29 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 29\",\n  \"content\": \", slogans and logos of the SELLER and the BUYER unless 32.10 Supplies manufactured based on the BUYER's drawings, designs, specifically identified as a deliverable or work product of the and/or specifications as well as any software code or models SELLER. With respect to any such excluded rights, the SELLER shall provided by the BUYER may not be used for the SELLER's own use not obtain any right, title or interest therein, even if at the BUYER's or sold to third parties without the BUYER's prior written consent. express instruction the SELLER shall include such excluded rights. 32.11 Nothing in these Terms is an admission by the BUYER of the 32.4 \\\"Background Intellectual Property Rights\\\" means any Intellectual validity of any Intellectual Property Rights claimed by the SELLER, Property Rights of either the BUYER or the SELLER relating to the including an admission that any license is required by the BUYER Supplies (i) existing prior to the effective date of a Purchase Order to manufacture / continue the Supplies. The SELLER will claim and or prior to the date the Parties began any technical cooperation acquire all rights and waivers of the SELLER's Personnel required relating to the Supplies, whichever is earlier, or (ii) that each Party to enable the SELLER to grant the BUYER the rights and licenses acquires or develops after these dates but in a strictly under these Terms. The SELLER assumes full and sole independent manner and entirely outside of any work conducted responsibility for compensating the SELLER's Personnel for such for or with the respective other Party. rights and waivers, including the remuneration of employees. 32.5 \\\"Foreground Intellectual Property Rights\\\" means any Intellectual 32.12 The SELLER, on behalf of itself and the BUYER and the BUYER Property Rights, except Background Intellectual Property Rights, Customers will comply with all obligations with respect to (i) that are developed in whole or in part by the BUYER alone, by software that forms any part of the Supplies, including obligations the Parties jointly or by the SELLER alone, in connection with a under any licenses. contractual relationship of the Parties or (ii) relating to the Supplies. 32.13 The SELLER will investigate, defend, hold harmless and indemnify the BUYER, its affiliates and the BUYER Customers (\\\"IP 32.6 The Parties will each retain\"\n}\n\n\n--- element 30 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 30\",\n  \"content\": \" Parties or (ii) relating to the Supplies. 32.13 The SELLER will investigate, defend, hold harmless and indemnify the BUYER, its affiliates and the BUYER Customers (\\\"IP 32.6 The Parties will each retain ownership of any Foreground Indemnified Parties\\\") against any actual or alleged claims of Intellectual Property Rights that are solely created or made by infringement or other assertions of proprietary rights violations their respective employees, agents or subcontractors (including patent, trademark, copyright, industrial design right, or (\\\"Personnel\\\"). The Parties will jointly own any Foreground other proprietary right, misuse, or misappropriation of trade Intellectual Property Rights that are jointly created or made by secret) and resulting damages and expenses (including legal and Personnel of both Parties with the ability to grant licenses without other professional fees) arising in any way in relation to the consultation and no duty of accounting to each other for any use Supplies, including such claims where the SELLER has provided or purpose. For clarity, unless an express written period of only part of the Supplies (collectively \\\"IP Claims\\\"). The SELLER exclusivity has been promised to the BUYER, Foreground expressly waives any claim against the IP Indemnified Parties that Intellectual Property Rights owned or controlled by the SELLER any such IP Claims arose out of compliance with any IP may be immediately exploited by the SELLER in connection with Indemnified Parties' specification or direction. its business with its other customers and will not be exclusive to the SELLER's performance towards the BUYER. The SELLER hereby 33. Subcontracting grants to the BUYER and causes its affiliates and Personnel to 33.1 The SELLER may not outfilename or subcontract any of its grant to the BUYER, an irrevocable, worldwide, non-exclusive, obligations towards the BUYER, without the BUYER's prior written perpetual to the maximum extent permitted by law, royalty free, consent. fully paid-up license, with right to sublicense to the BUYER's 33.2 Any such consent of the BUYER will not release the SELLER from, affiliates and BUYER Customers, to all Foreground Intellectual or limit, any of the SELLER's liability. The SELLER warrants and Property Rights owned by the SELLER solely or jointly with the guarantees that any such subcontractor's performance will satisfy BUYER to make, have made, use,\"\n}\n\n\n--- element 31 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 31\",\n  \"content\": \" limit, any of the SELLER's liability. The SELLER warrants and Property Rights owned by the SELLER solely or jointly with the guarantees that any such subcontractor's performance will satisfy BUYER to make, have made, use, reproduce, modify, improve, all requirements applicable to the SELLER under its relationship prepare derivative works of, distribute, display, perform, offer to with the BUYER. sell, sell and import the Supplies that are the subject of these Terms, without limitation. 33.3 The SELLER remains responsible and is liable for the performance of any approved subcontractor and shall ensure that any 32.7 The Parties will each retain ownership of their respective (approved) subcontractor meets all requirements agreed in these Background Intellectual Property Rights. The SELLER hereby Terms. grants to the BUYER and causes its affiliates and Personnel to grant to the BUYER, an irrevocable, worldwide, non-exclusive, 33.4 For this purpose, the SELLER shall carry out inspections or on-site perpetual to the maximum extent permitted by law, royalty free, audits of the (approved) subcontractor and any sub-suppliers on fully paid-up license, with right to sublicense to the BUYER's a regular basis and as directed by the BUYER. The SELLER shall also affiliates and BUYER Customers, to all Background Intellectual take all reasonable steps to enable the BUYER to audit the Property Rights to make, have made, use, reproduce, modify, SELLER's subcontractors and sub-suppliers and shall reasonably improve, prepare derivative works of, distribute, display, perform, assist the BUYER with such audits. offer to sell, sell and import the Supplies that are the subject of 34. Insurance these Terms (the \\\"Limited License\\\"), provided that the BUYER or 34.1 The SELLER is obliged to take out adequate insurance against the its affiliates and BUYER Customers will only use this Limited risks of a Recall Campaign, product liability and business License in the event that (i) the SELLER breaches or repudiates its obligations by being unable or unwilling to deliver Supplies, or Y-EMEA (Europe Middle East Africa) Internal Ref: Common_PU_2.04_Appendix_General Terms of Purchase Yazaki (Yazaki EMEA) EMEA (Europe Middle East Africa) Group (GToP) 38. Written Form interruption at an insurance coverage rate acceptable to the BUYER. Amendments and additions to these Terms must be in writing in order\"\n}\n\n\n--- element 32 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 32\",\n  \"content\": \"2.04_Appendix_General Terms of Purchase Yazaki (Yazaki EMEA) EMEA (Europe Middle East Africa) Group (GToP) 38. Written Form interruption at an insurance coverage rate acceptable to the BUYER. Amendments and additions to these Terms must be in writing in order to be effective, unless a stricter form is required by 34.2 The SELLER will insure the SELLER Property with coverage for all law; this also applies to this written form clause. losses for its replacement value. 39. No Waiver 34.3 The SELLER will furnish to the BUYER either a certificate showing compliance with these insurance requirements or certified copies The failure of the BUYER at any time to require performance by of all insurance policies within five Business Days of the BUYER's the SELLER will in no way affect the right to require such written request. performance at any time thereafter. 34.4 The certificate will provide that the BUYER will receive 20 Business 40. Severability Days' prior written notice of any termination or reduction in the If any provision in these Terms is invalid or unenforceable amount or scope of coverage. under applicable law or regulation, such term will be deemed 34.5 The SELLER's furnishing of certificates of insurance or purchase of revised or deleted, as the case may be, but only to the extent insurance will not release the SELLER of any of its obligations or necessary to comply with such applicable law or regulation, liabilities towards the BUYER. and the remaining provisions of these Terms will remain in full force and effect. 35. Confidentiality; No Advertising 35.1 No Party shall disclose any Confidential Information to any * * * authority, third party or the public unless such Party is legally obliged to disclose such information or such disclosure is necessary for the provision of the Supplies. \\\"Confidential Information\\\" means information which has been made available (whether before or after the date of this Agreement) by the disclosing Party in written, visual or machine readable form (including by fax and other forms of electronic transmission) or orally to the respective other Party with regard to the Agreement and/or the Supplies, and includes any information, analyses, compilations, notes, studies, memoranda or other documents derived from, containing or reflecting such information, but excludes information which: (i) was already lawfully in the recipient Party's possession at the time of disclosure thereof; (ii) is or later becomes part of the public\"\n}\n\n\n--- element 33 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 33\",\n  \"content\": \" memoranda or other documents derived from, containing or reflecting such information, but excludes information which: (i) was already lawfully in the recipient Party's possession at the time of disclosure thereof; (ii) is or later becomes part of the public domain through no fault of the recipient Party; or (iii) is received from a third party having no obligations of confidentiality to the disclosing Party. 35.2 The SELLER will not, without first obtaining the prior written consent of the BUYER, in any manner (i) advertise or publish the fact that the SELLER has contracted to furnish Supplies for the BUYER; (ii) use the BUYER's trademarks, trade names or information in the SELLER's advertising or promotional materials; or (iii) use the BUYER's Intellectual Property Rights, trademarks, trade names or (confidential) information in any form of electronic communication such as web sites (internal or external), blogs or other types of publication. 36. Non-Assignment 36.1 Under no circumstances may the SELLER transfer, assign or delegate, in whole or in part, any of its rights or obligations under its contractual relationship with the BUYER (including, in particular, any right of payment), whether directly or indirectly without the BUYER's prior written consent. 36.2 The BUYER is entitled to assign its rights and obligations in whole or in part, in particular to its affiliates or to a BUYER Customer. 37. Governing Law and Jurisdiction 37.1 These Terms and any claims relating to the Supplies provided by the SELLER will be governed by the laws of the country (and state/province, if applicable) of the BUYER entity issuing the respective order (\\\"BUYER Location\\\"), excluding the provisions of the United Nations Convention on Contracts for the International Sale of Goods and any conflict of law provisions that would require application of another choice of law. 37.2 Any action or proceedings by the BUYER against the SELLER may be brought by the BUYER in any court(s) having jurisdiction over the SELLER or, at the BUYER's option, in the court(s) having jurisdiction over BUYER Location, in which event the SELLER consents to such jurisdiction and service of process in accordance with applicable procedures. 37.3 Any actions or proceedings by the SELLER against the BUYER may be brought by the SELLER only in the court(s\"\n}\n\n\n--- element 34 ---\n{\n  \"filename\": \"General Terms of Purchase\",\n  \"section\": \"Part 34\",\n  \"content\": \" event the SELLER consents to such jurisdiction and service of process in accordance with applicable procedures. 37.3 Any actions or proceedings by the SELLER against the BUYER may be brought by the SELLER only in the court(s) having jurisdiction over the BUYER Location. Y-EMEA (Europe Middle East Africa) Internal Ref: Common_PU_2.04_Appendix_General Terms of Purchase Yazaki (Yazaki EMEA) EMEA (Europe Middle East Africa) Group (GToP) Definitions Background Intellectual Property Rights ................................................... 8 IP Claims ....................................................................................................9 Business Days ............................................................................................ 2 IP Indemnified Parties ............................................................................... 9 BUYER ....................................................................................................... 1 Limited License ......................................................................................... 8 BUYER Customer ....................................................................................... 1 New Supplier  ............................................................................................ 8 BUYER Customer Claim ............................................................................. 1 Order(s) .................................................................................................... 1 BUYER Customer Project ........................................................................... 1 Party/-ies .................................................................................................. 1 BUYER Customer Requirements ................................................................ 1 Personnel ................................................................................................. 8 BUYER Location ......................................................................................... 9 PPAP (Production Part Approval Process) ..........................................................................................................5 BUYER Property ......................................................................................... 3 Purchase Order(s) ..................................................................................... 1 BUYER-owned Tooling ............................................................................... 4 Recall Campaign ........................................................................................6 Call-off Orders ........................................................................................... 2 Release-Orders ......................................................................................... 2 Confidential Information ........................................................................... 9 SELLER ...................................................................................................... 1 EOP ........................................................................................................... 2 SELLER Property ....................................................................................... 5 Export Control Laws .................................................................................. 3 Spare Parts ............................................................................................... 2 Force Majeure Event ................................................................................. 7 Spot-Orders .............................................................................................. 2 Foreground Intellectual Property Rights .................................................... 8 Supplies .....................................................................................................1 Incoterms .................................................................................................. 3 Terms ........................................................................................................1 Intellectual Property Rights ....................................................................... 8 Transition Support .....................................................................................8 Y-EMEA (Europe Middle East Africa) Internal Ref: Common_PU_2.04_Appendix_General Terms of Purchase Yazaki (Yazaki EMEA) EMEA (Europe Middle East Africa) Group (GToP)\"\n}\n",
    "metadata": {
      "filename": "General_Terms_of_Purchase_clean",
      "source_type": "list_of_dicts",
      "original_length": 34
    }
  }
]