[
  {
    "page_content": "Yazaki (Yazaki EMEA) EMEA (Europe Middle East Africa)\nBusiness Partner Code of Conduct (“Code”)\nEffective as of June 2023\nIntroduction\nYAZAKI  – EMEA (“we”, the “Company\" or “Yazaki (Yazaki EMEA)”) is a group of companies owned by\nYazaki (Yazaki EMEA) Corporation located in Europe, Middle East and Africa. Being a worldwide\nleading manufacturer of wire harnesses and electronic car components, Yazaki (Yazaki EMEA)’s\nambition is to be a “corporation needed by society”, i.e., a trusted supplier of\ntraditional and innovative automotive solutions, which will enable better mobility and\nconnectivity while taking care of the society’s sustainability agenda and welfare. We\nare committed to conducting our business activities in full compliance with applicable\nlaws, respecting human rights, including employees’ rights, protecting the\nenvironment, enabling fair competition and fighting against corruption. In addition to\nthose internationally recognized principles, our corporate values speak for respect,\ntrust and mutual support. We can achieve that ambition by maintaining a network of\nbusiness partners which share the same values and adhere to the same standards.\nThis Code sets out the expectations and minimum requirements that our business\npartners (“Business Partners”) are to observe so as to eligibly supply and maintain\nsuccessful cooperation with Yazaki (Yazaki EMEA). We expect them to ensure that these expectations\nand requirements are communicated to their employees, directors and officers, and\nto their direct suppliers, and that those suppliers appropriately pass on these\nexpectations and minimum requirements along the supply chain.\n1. Responsible business practices\nYazaki (Yazaki EMEA) expects and its Business Partners agree to act ethically and in compliance\nwith all applicable laws and regulations, and to obtain their competitive edge only\nby superior products, technology, reliability, and the quality of services.\n1.1. Fair competition and antitrust\nYazaki (Yazaki EMEA) respects fair competition and expects our Business Partners to comply\nwith antitrust laws which protect and promote fair and free, undistorted, and\neffective competition. Our Business Partners do not participate in any anti-\ncompetitive arrangements or agreements with competitors, business\npartners or other third parties (e.g. exchange of competitively sensitive\ninformation, price fixing, allocation of markets or customers), and do not\nabuse their market power. They properly address all antitrust risks arising\nfrom their economic activities and their corporate set-up.\n2\nEA-PU-xx-F-75, Rev. 0.1, 18-Nov-2024",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 2,
      "type": "text",
      "chunk_size": 2488,
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "1.2. Anti-corruption and anti-bribery\nYazaki (Yazaki EMEA) has a zero-tolerance rule regarding corruption, bribery and extortion.\nThe Company takes action against any form of such practice. Our Business\nPartners do the same by adopting anti-bribery policies, educating employees\nand taking actions against any acts of corruption and bribery. In particular,\nYazaki (Yazaki EMEA) requires from its Business Partners to reject and prevent all forms of\ncorruption, including what are known as facilitation payments (payments to\nspeed up the performance of routine tasks by public officials, e.g. at customs\nclearance). The Business Partners must ensure that its affiliates, directors,\nofficers, employees, agents and sub-contractors do not directly or indirectly\ngrant, offer, promise, approve, give, accept, request or solicit bribes,\nkickbacks, facilitation payments, improper donations or other improper\npayments or benefits (including the provision of socially inadequate\nentertainment and hospitality), to or from customers, government officials\nor other third parties, in order to improperly influence any act or decision of\nsuch customers, government officials or other third parties, to obtain or\nretain business or secure any improper advantage.\nOur Business Partners refrain from offering or granting unreasonable and\ninappropriate benefits (including goods, services, invitations to non-work\nrelated cultural or sports events, recreational trips, private sales\nopportunities) to employees, directors or officers of Yazaki (Yazaki EMEA) to facilitate the\nBusiness Partner’s business with Yazaki (Yazaki EMEA). This does not apply to reasonable\nand socially adequate hospitality and product-related events in the usual\ncourse of business. Irrespective of the type of gifts and hospitality, the\nBusiness Partners must exclude any undue personal advantage and avoid any\nsemblance of bribery, corruption or any other undue influence.\n1.3. Avoiding conflicts of interest\nOur Business Partners make decisions solely based on objective criteria and\ndisclose to Yazaki (Yazaki EMEA) any situation that might appear as a conflict of interest.\nOur Business Partners must inform Yazaki (Yazaki EMEA) if, to the best of their knowledge,\nan employee, director, officer or an agent of Yazaki (Yazaki EMEA) may have an interest of\nany kind in the Business Partner's business or any kind of economic ties with\nthe Business Partner.\n1.4. Anti-money laundering and prohibition of terrorism financing\nOur Business Partners ensure compliance with all applicable laws and\nregulations against money laundering and terrorism financing. They make\nsure that they know their business partners, and report immediately to the\ncompetent authorities if there are facts which indicate that a case of money\nlaundering has occurred.\n1.5. Export controls and economic sanctions\nOur Business Partners maintain and enforce policies, procedures and\nsafeguards to ensure compliance with applicable customs regulations,\n3\nEA-PU-xx-F-75, Rev. 0.1, 18-Nov-2024",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 3,
      "type": "text",
      "chunk_size": 2927,
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "export/import restrictive measures, including economic sanctions. The\nBusiness Partners undertake:\n• to comply with all applicable sanctions and export control laws and\nregulations\n• not to use any funds or economic resources related to the business\nrelationship (or parts of it) with Yazaki (Yazaki EMEA), or make them available, directly\nor indirectly to any sanctioned person\n• not to otherwise engage, directly or indirectly, in any activity that would\nconstitute a breach of, or cause Yazaki (Yazaki EMEA) to be in violation, of any restrictive\nmeasures.\nThe Business Partners ensure that their subsidiaries and affiliates in which\nthey hold a decisive interest, or in which any of their members of the\nsupervisory board or the management board have a financial interest, act\naccordingly.\nThe Business Partners confirm that any items or goods being sold, exported,\ndelivered or transferred within the business relationship with Yazaki (Yazaki EMEA) are\neither not restricted under applicable sanctions or export control restrictive\nmeasures, or in case there are any restrictions, the respective Business\nPartner has obtained prior authorizations from any competent authority, in\nparticular in the EU, UK and US, to export such items.\nIn case the circumstances outlined above shall change or the Business\nPartner has a reason to believe that such circumstances may change, the\nBusiness Partner must notify Yazaki (Yazaki EMEA) in writing with immediate effect.\n1.6. Data protection and data security\nOur Business Partners respect individuals’ privacy and accordingly ensure the\nproper, confidential and responsible use and protection of personal data, in\ncompliance with all applicable laws. They ensure that all personal data and\nother confidential information are appropriately collected, processed,\nsecured, stored, and cannot be accessed without proper authorization.\n1.7. Intellectual property\nOur Business Partners respect the legitimate intellectual property rights\n(including copyrights, software, designs, know-how, patents, and\ntrademarks) of their business partners and other third parties.\nBusiness Partners are expected to develop, implement, and maintain\neffective methods and processes to minimize the risk of introducing\ncounterfeit parts or materials into the supply chain. Business Partners must\nimmediately notify Yazaki (Yazaki EMEA) of counterfeit products labelled or marketed as\nYazaki (Yazaki EMEA) products.\n4\nEA-PU-xx-F-75, Rev. 0.1, 18-Nov-2024",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 4,
      "type": "text",
      "chunk_size": 2392,
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "1.8. Product  compliance and safety\nOur Business Partners ensure the conformity and safety of their products\nwith applicable laws and regulations.\n1.9. Financial responsibility and accounting\nOur Business Partners keep accurate records of their business expenditures\nand never conceal the true nature of an expense. Business Partners should\nperform their business dealings in a transparent manner and accurately\nreflect them in the companies’ financial reports and filings. Business Partners\nshould confirm an adequate financial reporting system control is in place.\n2. Social responsibility and respect of human rights\nFor Yazaki (Yazaki EMEA), the social responsibility and especially the respect for internationally\nrecognized human rights as included in the International Bill of Human Rights, the\nUN Guiding Principles on Business and Human Rights, the OECD Guidelines for\nMultinational Enterprises, the ILO Core Labor Standards, the principles of the UN\nGlobal Compact as well as the applicable supply chain legislation form the basis\nfor all our business relationships.\n2.1. Human rights\nOur Business Partners respect these internationally recognized human rights,\nand actively protect those rights of individuals or groups, irrespective of their\nnationality, place of residence, sex, national or ethnic origin, color, religion,\nor any other status.\n2.2. Prohibition of child labor and rights of young workers\nOur Business Partners do not tolerate child labor within their own operations\nor within its direct suppliers. They ensure that they do not employ directly or\nindirectly persons under the applicable legal minimum working age. They\nalso respect all regulations for the protection of employees under the age of\n18.\n2.3. Prohibition of modern slavery, forced labor and unethical recruiting\nOur Business Partners do not tolerate the use of any kind of slavery,\nservitude, forced or compulsory labor or human trafficking.\nFurthermore, our Business Partners do not mislead or defraud potential\nemployees about the nature of work, ask employees to pay recruitment fees\nor inappropriate transportation fees, and/or confiscate, destroy, conceal,\nand/or deny access to employee passports and other identity documents\nissued by government and/or restrict the employees’ freedom of movement\nor require employees to involuntarily use accommodation provided by the\ncompany for no operational reason.\n5\nEA-PU-xx-F-75, Rev. 0.1, 18-Nov-2024",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 5,
      "type": "text",
      "chunk_size": 2425,
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "2.4. Working hours\nOur Business Partners ensure that they comply with all applicable regulations\non working hours including overtime, maximum hours, and rest periods, with\na maximum of 48 hours per regular workweek with a rest period of at least\n24 consecutive hours every seven days shall apply to prevent excessive\nphysical and mental fatigue.\n2.5. Freedom of association and collective bargaining\nOur Business Partners respect the rights of all employees to form and join\ntrade unions and employee representations, and to engage in collective\nbargaining and strikes. This precludes any form of discrimination or retaliatory\nmeasures based on union activities. Even in case such rights are restricted or\nnot provided at all by local law, our Business Partners ensure that the\nconcerns of their employees are heard and considered without fear of\nintimidation, harassment or retaliation.\n2.6. Non-discrimination\nYazaki (Yazaki EMEA) expects that its Business Partners respect the basic rights of\nemployees and treat them fairly, promote diversity, equity and inclusion, and\nprovide equal opportunities to all their employees, in particular, the payment\nof equal remuneration for work of equal value.\nOur Business Partners ensure that their working environment is free from\nretaliation, discrimination, intimidation, harassment or any other improper\nconduct, for example based on ethnic decent, origin, nationality, religion,\nideology, gender, sexual orientation, gender identity, age, disability, medical\ncondition, race, color or their social background or any other characteristics.\n2.7. Health and safety\nOur Business Partners provide sufficient processes, resources and standards\nto set up a management system assuring compliance with all applicable\noccupational health, safety, and fire safety legislation. They ensure that\nregular risk assessments, reporting and training of their employees are\nperformed to prevent any accidents and occupational diseases from\noccurring, according to ISO (International Organization for Standardization) 45001 or similar auditable standard.\n2.8. Wages and benefits\nOur Business Partners pay at least an adequate living wage, which amounts\nto at least the minimum wage as laid down by the applicable law and, apart\nfrom that, is determined in accordance with the regulations of the place of\nemployment that ensures an appropriate standard of living for their\nemployees and their families.\n6\nEA-PU-xx-F-75, Rev. 0.1, 18-Nov-2024",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 6,
      "type": "text",
      "chunk_size": 2403,
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "2.9. Conflict minerals\nOur Business Partners must ensure that they comply with all applicable\nsupply chain due diligence obligations for the sourcing of raw materials, in\nparticular conflict minerals (e.g., tin, tantalum, tungsten and gold, as\nprovided in the Dodd-Frank Wall Street Reform Act, Sect. 1502, the\nRegulation (EU) 2017/821 and other similar legislations).\n2.10. No forced eviction, respect of land, forest and water rights\nOur Business Partners also comply with the prohibition of unlawful eviction\nand deprivation of land, forests and waters that serve as a person’s livelihood\nduring the whole production cycle.\n2.11. Community engagement\nYazaki (Yazaki EMEA) cooperates with Business Partners who respect the rights, the\nlivelihoods, the cultures and traditions of local communities in each country\nwhere they operate. We encourage our Business Partners to engage with the\nlocal communities, to identify their needs and support economic\ndevelopment, and to further contribute towards sustainability and deliver\npositive social impact.\n2.12. Vulnerable groups\nOur Business Partners respect the rights of minorities, indigenous people,\nwomen, children, human right defenders and other vulnerable groups and\nstrive to avoid any negative impact on them. In particular, our Business\nPartners comply with the principles of free, prior, and informed consent of\nindigenous peoples in its activities in connection with their land and its\ncultivation as well as other natural resources.\n2.13. Use of private or public security forces\nOur Business Partners ensure that the use of private or public security forces\ndoes not lead to violations of human rights, in particular to torture and cruel,\ninhuman, or degrading treatment, damages to life or limb or to the\nimpairment of the freedom of association. The Business Partners ensure as\nwell not to contribute directly or indirectly to supporting private or public\nsecurity forces that unlawfully exercise control over mining sites,\ntransportation routes and upstream stakeholders in the supply chain.\n7\nEA-PU-xx-F-75, Rev. 0.1, 18-Nov-2024",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 7,
      "type": "text",
      "chunk_size": 2080,
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "3. Your responsibility for the protection of the environment\nYazaki (Yazaki EMEA) is committed to preserving the environment and its resources for current\nand future generations. Yazaki (Yazaki EMEA)’s goals and continuous progress are shared and\ncommunicated in the annual Sustainability Report published on www.yazaki-\neurope.com\n3.1. General expectations regarding environment\nOur Business Partners set up a management system assuring compliance\nwith existing legislation and Yazaki (Yazaki EMEA)’s requirements regarding the protection\nof the environment. They adopt effective environmental policies, establish\nadequate environmental objectives and targets to eliminate and/or minimize\nnegative environmental impacts. Furthermore, they define, implement and\nmonitor dedicated action plans, to educate their employees, and to make\ncontinuous efforts to reduce the impact of their footprint on the\nenvironment.\nOur Business Partners support Yazaki (Yazaki EMEA)’s vision on sustainability throughout\nthe supply chain by implementing a sustainable and efficient resource\nmanagement system and contributing to circular economy, including:\n• use of sustainable, recycled and renewable natural resources,\n• reduction of waste production and increase of waste reuse and recycling,\n• protection of air quality and minimization of air emissions,\n• increasing energy efficiency and the use of renewable energy where\navailable,\n• reducing single use plastic,\n• responsible chemical management including the administration of\nenvironmentally hazardous substances,\n• avoiding any harmful soil change, water pollution, air pollution, harmful\nnoise emission or excessive water consumption that significantly impairs\nthe natural bases for the preservation and production of food, denies a\nperson access to safe and clean drinking water, makes it difficult for a\nperson to access sanitary facilities or destroys them or harms the health\nof a person.\n3.2. Environment product compliance\nOur Business Partners comply with all applicable laws and regulations\nconcerning hazardous materials, chemicals and substances that apply to the\nrelevant market and/or the business location (e.g. the EU REACH (Registration, Evaluation, Authorization and Restriction of Chemicals) Regulation,\nthe Minamata Convention on Mercury, the Stockholm Convention on\nPersistent Organic Pollutants and the Basel Convention on the Control of\nTransboundary Movements of Hazardous Waste and their Disposal).\n8\nEA-PU-xx-F-75, Rev. 0.1, 18-Nov-2024",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 8,
      "type": "text",
      "chunk_size": 2377,
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "Our Business Partners provide products that are fully compliant with all\napplicable environmental product compliance legislation.\n3.3. Carbon neutrality and GHG emissions reporting\nYazaki (Yazaki EMEA) strives towards achieving carbon neutrality and requires its Business\nPartners to ensure that their business model and strategy are aligned with\nthe objectives of the transition to a sustainable economy in line with the Paris\nAgreement and the objective of achieving climate neutrality and being\navailable to disclose information regarding environmental impacts, including\nbut not limited to decarbonization performance.\nOur Business Partners provide information on request in relation to the\noverall energy consumption and carbon emissions (scope 1, 2 and 3, in\naccordance with GHG protocol).\n3.4. Protection of biodiversity\nOur Business Partners preserve the global environment and its resources.\nThey protect natural ecosystems, especially key biodiversity areas impacted\nby their operations, and avoid illegal deforestation and adverse land use\nleading to reduction of soil quality in accordance with the applicable\nbiodiversity regulations.\n3.5. Animal welfare\nOur Business Partners support animal welfare and promote ethical\ntreatment of animals.\n4. Your responsibility for the compliance with this Code\nYazaki (Yazaki EMEA) considers compliance with the provisions of this Code as essential for\nany business relationship with its Business Partners. Therefore, our Business\nPartners support Yazaki (Yazaki EMEA) and share this responsibility.\n4.1. Continuous improvement\nThis Code provides for the expectations and minimum requirements which\nBusiness Partners must meet. Yazaki (Yazaki EMEA) expects Business Partners to exceed\nthose minimum standards, and to strive to meet the industry best practices.\nYazaki (Yazaki EMEA) recognizes that the latter is a dynamic process and encourages\nBusiness Partners to continually improve and adapt.\n4.2. Passing on the requirements of this Code along the supply chain\nOur Business Partners make their employees and business partners familiar\nwith the requirements of this Code. Our Business Partners pass on these\nprinciples and the related obligations to their business partners as well.\n9\nEA-PU-xx-F-75, Rev. 0.1, 18-Nov-2024",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 9,
      "type": "text",
      "chunk_size": 2206,
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "4.3. Monitoring\nOur Business Partners establish and maintain processes that identify and\neliminate risks arising from non-compliance with this Code.\n4.4. Disclosure of information and audit right\nBusiness Partners record information regarding their business activities,\nworking methods, health, safety, environmental practices and other matters\nnamed in this Code. At any point of its relationship with them, Yazaki (Yazaki EMEA) may\nask its Business Partners for confirmation and verification of compliance with\nthis Code, insofar as the disclosure does not violate legal requirements.\nIf the Business Partners identify any potential violation of these obligations,\nthey immediately inform Yazaki (Yazaki EMEA) and initiate adequate mitigation measures\nwithin a reasonable time. If such measures cannot end the violation in the\nforeseeable future, the Business Partners agree to draw up and implement,\njointly with Yazaki (Yazaki EMEA), a concept for ending or minimizing the violation without\nundue delay.\nYazaki (Yazaki EMEA) reserves the right to audit the Business Partners’ compliance with this\nCode in line with the applicable law, in an appropriate manner and at\nbusiness hours as mutually agreed with the respective Business Partner.\n4.5. Consequences in case of non-compliance\nIn case of non-compliance with any expectation or requirement as set out in\nthis Code, Yazaki (Yazaki EMEA) reserves the right to take appropriate legal action, including\nto claim damages. The same applies if a Business Partner fails or refuses to\nimplement measures for improving their sustainability performance.\nWithout prejudice to any further rights and subject to applicable law, Yazaki (Yazaki EMEA)\nreserves the right to terminate the business relationship in case of any\nmaterial breach of this Code.\n4.6. Whistleblowing and grievance mechanism, protection against retaliation\nOur Business Partners enable and encourage their employees and business\npartners to speak up in the event of non-compliance with the requirements\nof this Code.\nOur Business Partners, their employees and any other third parties can send\nus such reports via email to compliance@yazaki-europe.com or by using our\nwhistleblowing hotline which can be accessed at Yazaki (Yazaki EMEA) EMEA (Europe Middle East Africa) Speak-Up Line.\nAll reports will be treated confidentially.\nOur Business Partners prohibit and do not tolerate retaliation against any\nperson who reported in good faith non-compliance with the requirements of\nthis Code.\n10\nEA-PU-xx-F-75, Rev. 0.1, 18-Nov-2024",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 10,
      "type": "text",
      "chunk_size": 2417,
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "4.7. Additional information and support\nFor further information and guidance on this Code, Business Partners can\ncontact Yazaki (Yazaki EMEA)’s purchasing team via the supplier section on our homepage\n(https://www.yazaki-europe.com/supplier).\nWe hereby confirm that we understand, share, respect and adhere to the\nprovisions of this Code.\nCompany Name __________________________________________\nAddress: __________________________________________\nDate and Signature: __________________________________________\nFunction of Signee: __________________________________________\n11\nEA-PU-xx-F-75, Rev. 0.1, 18-Nov-2024",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 11,
      "type": "text",
      "chunk_size": 598,
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "YAZAKI \nBUSINESS PARTNER CODE OF CONDUCT\n2023",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 1,
      "type": "text",
      "extraction_method": "pdfplumber",
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "FLOWCHART / PROCESS DIAGRAM:\n\nProcess Steps:\n  1. K\n\nTotal steps identified: 1",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 1,
      "type": "flowchart",
      "image_index": 0,
      "extraction_method": "flowchart_ocr",
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "FLOWCHART / PROCESS DIAGRAM:\n\nProcess Steps:\n  1. YAZAK!I EMIEA\n  2. BUSINESS PARTNER CODE OF CONDUCT\n  3. 2023\n  4. WW YAZAKI \n\nTotal steps identified: 4",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 1,
      "type": "flowchart",
      "image_index": null,
      "extraction_method": "flowchart_ocr",
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "Yazaki (Yazaki EMEA) EMEA (Europe Middle East Africa)\nBusiness Partner Code of Conduct (“Code”)\nEffective as of June 2023\nIntroduction\nYAZAKI  – EMEA (“we”, the “Company\" or “Yazaki (Yazaki EMEA)”) is a group of companies owned by\nYazaki (Yazaki EMEA) Corporation located in Europe, Middle East and Africa. Being a worldwide\nleading manufacturer of wire harnesses and electronic car components, Yazaki (Yazaki EMEA)’s\nambition is to be a “corporation needed by society”, i.e., a trusted supplier of\ntraditional and innovative automotive solutions, which will enable better mobility and\nconnectivity while taking care of the society’s sustainability agenda and welfare. We\nare committed to conducting our business activities in full compliance with applicable\nlaws, respecting human rights, including employees’ rights, protecting the\nenvironment, enabling fair competition and fighting against corruption. In addition to\nthose internationally recognized principles, our corporate values speak for respect,\ntrust and mutual support. We can achieve that ambition by maintaining a network of\nbusiness partners which share the same values and adhere to the same standards.\nThis Code sets out the expectations and minimum requirements that our business\npartners (“Business Partners”) are to observe so as to eligibly supply and maintain\nsuccessful cooperation with Yazaki (Yazaki EMEA). We expect them to ensure that these expectations\nand requirements are communicated to their employees, directors and officers, and\nto their direct suppliers, and that those suppliers appropriately pass on these\nexpectations and minimum requirements along the supply chain.\n1. Responsible business practices\nYazaki (Yazaki EMEA) expects and its Business Partners agree to act ethically and in compliance\nwith all applicable laws and regulations, and to obtain their competitive edge only\nby superior products, technology, reliability, and the quality of services.\n1.1. Fair competition and antitrust\nYazaki (Yazaki EMEA) respects fair competition and expects our Business Partners to comply\nwith antitrust laws which protect and promote fair and free, undistorted, and\neffective competition. Our Business Partners do not participate in any anti-\ncompetitive arrangements or agreements with competitors, business\npartners or other third parties (e.g. exchange of competitively sensitive\ninformation, price fixing, allocation of markets or customers), and do not\nabuse their market power. They properly address all antitrust risks arising\nfrom their economic activities and their corporate set-up.\n2\nEA-PU-xx-F-75, Rev. 0.1, 18-Nov-2024",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 2,
      "type": "text",
      "extraction_method": "pdfplumber",
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "FLOWCHART / PROCESS DIAGRAM:\n\nProcess Steps:\n  1. Yazaki (Yazaki EMEA) EMEA (Europe Middle East Africa)\n  2. Business Partner Code of Conduct (“Code”)\n  3. Effective as of June 2023\n  4. Introduction\n  5. YAZAKI  — EMEA (“we”, the “Company\" or “Yazaki (Yazaki EMEA)”) is a group of companies owned by\n  6. Yazaki (Yazaki EMEA) Corporation located in Europe, Middle East and Africa. Being a worldwide\n  7. leading manufacturer of wire harnesses and electronic car components, Yazaki (Yazaki EMEA)’s\n  8. ambition is to be a “corporation needed by society”, i.e., a trusted supplier of\n  9. traditional and innovative automotive solutions, which will enable better mobility and\n  10. connectivity while taking care of the society’s sustainability agenda and welfare. We\n  11. are committed to conducting our business activities in full compliance with applicable\n  12. laws,\n  13. respecting human\n  14. rights,\n  15. including employees’\n  16. rights,\n  17. protecting the\n  18. environment, enabling fair competition and fighting against corruption. In addition to\n  19. those internationally recognized principles, our corporate values speak for respect,\n  20. trust and mutual support. We can achieve that ambition by maintaining a network of\n  21. business partners which share the same values and adhere to the same standards.\n  22. This Code sets out the expectations and minimum requirements that our business\n  23. partners (“Business Partners”) are to observe so as to eligibly supply and maintain\n  24. successful cooperation with Yazaki (Yazaki EMEA). We expect them to ensure that these expectations\n  25. and requirements are communicated to their employees, directors and officers, and\n  26. to their direct suppliers, and that those suppliers appropriately pass on these\n  27. expectations and minimum requirements along the supply chain.\n  28. 1. Responsible business practices\n  29. Yazaki (Yazaki EMEA) expects and its Business Partners agree to act ethically and in compliance\n  30. with all applicable laws and regulations, and to obtain their competitive edge only\n  31. by superior products, technology, reliability, and the quality of services.\n  32. 1.1. Fair competition and antitrust\n  33. Yazaki (Yazaki EMEA) respects fair competition and expects our Business Partners to comply\n  34. with antitrust laws which protect and promote fair and free, undistorted, and\n  35. effective competition. Our Business Partners do not participate in any anti-\n  36. competitive arrangements or agreements with competitors, business\n  37. partners or other third parties (e.g. exchange of competitively sensitive\n  38. information, price fixing, allocation of markets or customers), and do not\n  39. abuse their market power. They properly address all antitrust risks arising\n  40. from their economic activities and their corporate set-up.\n  41. EA-PU-xx-F-75, Rev. 0:1, 18-Nov-2024\n\nTotal steps identified: 41",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 2,
      "type": "flowchart",
      "image_index": null,
      "extraction_method": "flowchart_ocr",
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "1.2. Anti-corruption and anti-bribery\nYazaki (Yazaki EMEA) has a zero-tolerance rule regarding corruption, bribery and extortion.\nThe Company takes action against any form of such practice. Our Business\nPartners do the same by adopting anti-bribery policies, educating employees\nand taking actions against any acts of corruption and bribery. In particular,\nYazaki (Yazaki EMEA) requires from its Business Partners to reject and prevent all forms of\ncorruption, including what are known as facilitation payments (payments to\nspeed up the performance of routine tasks by public officials, e.g. at customs\nclearance). The Business Partners must ensure that its affiliates, directors,\nofficers, employees, agents and sub-contractors do not directly or indirectly\ngrant, offer, promise, approve, give, accept, request or solicit bribes,\nkickbacks, facilitation payments, improper donations or other improper\npayments or benefits (including the provision of socially inadequate\nentertainment and hospitality), to or from customers, government officials\nor other third parties, in order to improperly influence any act or decision of\nsuch customers, government officials or other third parties, to obtain or\nretain business or secure any improper advantage.\nOur Business Partners refrain from offering or granting unreasonable and\ninappropriate benefits (including goods, services, invitations to non-work\nrelated cultural or sports events, recreational trips, private sales\nopportunities) to employees, directors or officers of Yazaki (Yazaki EMEA) to facilitate the\nBusiness Partner’s business with Yazaki (Yazaki EMEA). This does not apply to reasonable\nand socially adequate hospitality and product-related events in the usual\ncourse of business. Irrespective of the type of gifts and hospitality, the\nBusiness Partners must exclude any undue personal advantage and avoid any\nsemblance of bribery, corruption or any other undue influence.\n1.3. Avoiding conflicts of interest\nOur Business Partners make decisions solely based on objective criteria and\ndisclose to Yazaki (Yazaki EMEA) any situation that might appear as a conflict of interest.\nOur Business Partners must inform Yazaki (Yazaki EMEA) if, to the best of their knowledge,\nan employee, director, officer or an agent of Yazaki (Yazaki EMEA) may have an interest of\nany kind in the Business Partner's business or any kind of economic ties with\nthe Business Partner.\n1.4. Anti-money laundering and prohibition of terrorism financing\nOur Business Partners ensure compliance with all applicable laws and\nregulations against money laundering and terrorism financing. They make\nsure that they know their business partners, and report immediately to the\ncompetent authorities if there are facts which indicate that a case of money\nlaundering has occurred.\n1.5. Export controls and economic sanctions\nOur Business Partners maintain and enforce policies, procedures and\nsafeguards to ensure compliance with applicable customs regulations,\n3\nEA-PU-xx-F-75, Rev. 0.1, 18-Nov-2024",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 3,
      "type": "text",
      "extraction_method": "pdfplumber",
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "FLOWCHART / PROCESS DIAGRAM:\n\nProcess Steps:\n  1. 1.2. Anti-corruption and anti-bribery\n  2. Yazaki (Yazaki EMEA) has a zero-tolerance rule regarding corruption, bribery and extortion.\n  3. The Company takes action against any form of such practice. Our Business\n  4. Partners do the same by adopting anti-bribery policies, educating employees\n  5. and taking actions against any acts of corruption and bribery. In particular,\n  6. Yazaki (Yazaki EMEA) requires from its Business Partners to reject and prevent all forms of\n  7. corruption, including what are known as facilitation payments (payments to\n  8. speed up the performance of routine tasks by public officials, e.g. at customs\n  9. clearance). The Business Partners must ensure that its affiliates, directors,\n  10. officers, employees, agents and sub-contractors do not directly or indirectly\n  11. grant, offer, promise, approve, give, accept, request or solicit bribes,\n  12. kickbacks, facilitation payments, improper donations or other improper\n  13. payments or benefits (including the provision of socially inadequate\n  14. entertainment and hospitality), to or from customers, government officials\n  15. or other third parties, in order to improperly influence any act or decision of\n  16. such customers, government officials or other third parties, to obtain or\n  17. retain business or secure any improper advantage.\n  18. Our Business Partners refrain from offering or granting unreasonable and\n  19. inappropriate benefits (including goods, services, invitations to non-work\n  20. related cultural\n  21. or\n  22. sports events,\n  23. recreational\n  24. trips,\n  25. private sales\n  26. opportunities) to employees, directors or officers of Yazaki (Yazaki EMEA) to facilitate the\n  27. Business Partner’s business with Yazaki (Yazaki EMEA). This does not apply to reasonable\n  28. and socially adequate hospitality and product-related events in the usual\n  29. course of business. Irrespective of the type of gifts and hospitality, the\n  30. Business Partners must exclude any undue personal advantage and avoid any\n  31. semblance of bribery, corruption or any other undue influence.\n  32. 1.3\n  33. Avoiding conflicts of interest\n  34. Our Business Partners make decisions solely based on objective criteria and\n  35. disclose to Yazaki (Yazaki EMEA) any situation that might appear as a conflict of interest.\n  36. Our Business Partners must inform Yazaki (Yazaki EMEA) if, to the best of their knowledge,\n  37. an employee, director, officer or an agent of Yazaki (Yazaki EMEA) may have an interest of\n  38. any kind in the Business Partner's business or any kind of economic ties with\n  39. the Business Partner.\n  40. 1.4\n  41. Anti-money laundering and prohibition of terrorism financing\n  42. Our Business Partners ensure compliance with all applicable laws and\n  43. regulations against money laundering and terrorism financing. They make\n  44. sure that they know their business partners, and report immediately to the\n  45. competent authorities if there are facts which indicate that a case of money\n  46. laundering has occurred.\n  47. 1.5\n  48. Export controls and economic sanctions\n  49. Our Business Partners maintain and enforce policies, procedures and\n  50. safeguards to ensure compliance with applicable customs regulations,\n  51. 3\n  52. EA-PU-xx-F-75, Rev. 0:1, 18-Nov-2024\n\nTotal steps identified: 52",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 3,
      "type": "flowchart",
      "image_index": null,
      "extraction_method": "flowchart_ocr",
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "export/import restrictive measures, including economic sanctions. The\nBusiness Partners undertake:\n• to comply with all applicable sanctions and export control laws and\nregulations\n• not to use any funds or economic resources related to the business\nrelationship (or parts of it) with Yazaki (Yazaki EMEA), or make them available, directly\nor indirectly to any sanctioned person\n• not to otherwise engage, directly or indirectly, in any activity that would\nconstitute a breach of, or cause Yazaki (Yazaki EMEA) to be in violation, of any restrictive\nmeasures.\nThe Business Partners ensure that their subsidiaries and affiliates in which\nthey hold a decisive interest, or in which any of their members of the\nsupervisory board or the management board have a financial interest, act\naccordingly.\nThe Business Partners confirm that any items or goods being sold, exported,\ndelivered or transferred within the business relationship with Yazaki (Yazaki EMEA) are\neither not restricted under applicable sanctions or export control restrictive\nmeasures, or in case there are any restrictions, the respective Business\nPartner has obtained prior authorizations from any competent authority, in\nparticular in the EU, UK and US, to export such items.\nIn case the circumstances outlined above shall change or the Business\nPartner has a reason to believe that such circumstances may change, the\nBusiness Partner must notify Yazaki (Yazaki EMEA) in writing with immediate effect.\n1.6. Data protection and data security\nOur Business Partners respect individuals’ privacy and accordingly ensure the\nproper, confidential and responsible use and protection of personal data, in\ncompliance with all applicable laws. They ensure that all personal data and\nother confidential information are appropriately collected, processed,\nsecured, stored, and cannot be accessed without proper authorization.\n1.7. Intellectual property\nOur Business Partners respect the legitimate intellectual property rights\n(including copyrights, software, designs, know-how, patents, and\ntrademarks) of their business partners and other third parties.\nBusiness Partners are expected to develop, implement, and maintain\neffective methods and processes to minimize the risk of introducing\ncounterfeit parts or materials into the supply chain. Business Partners must\nimmediately notify Yazaki (Yazaki EMEA) of counterfeit products labelled or marketed as\nYazaki (Yazaki EMEA) products.\n4\nEA-PU-xx-F-75, Rev. 0.1, 18-Nov-2024",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 4,
      "type": "text",
      "extraction_method": "pdfplumber",
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "1.8. Product  compliance and safety\nOur Business Partners ensure the conformity and safety of their products\nwith applicable laws and regulations.\n1.9. Financial responsibility and accounting\nOur Business Partners keep accurate records of their business expenditures\nand never conceal the true nature of an expense. Business Partners should\nperform their business dealings in a transparent manner and accurately\nreflect them in the companies’ financial reports and filings. Business Partners\nshould confirm an adequate financial reporting system control is in place.\n2. Social responsibility and respect of human rights\nFor Yazaki (Yazaki EMEA), the social responsibility and especially the respect for internationally\nrecognized human rights as included in the International Bill of Human Rights, the\nUN Guiding Principles on Business and Human Rights, the OECD Guidelines for\nMultinational Enterprises, the ILO Core Labor Standards, the principles of the UN\nGlobal Compact as well as the applicable supply chain legislation form the basis\nfor all our business relationships.\n2.1. Human rights\nOur Business Partners respect these internationally recognized human rights,\nand actively protect those rights of individuals or groups, irrespective of their\nnationality, place of residence, sex, national or ethnic origin, color, religion,\nor any other status.\n2.2. Prohibition of child labor and rights of young workers\nOur Business Partners do not tolerate child labor within their own operations\nor within its direct suppliers. They ensure that they do not employ directly or\nindirectly persons under the applicable legal minimum working age. They\nalso respect all regulations for the protection of employees under the age of\n18.\n2.3. Prohibition of modern slavery, forced labor and unethical recruiting\nOur Business Partners do not tolerate the use of any kind of slavery,\nservitude, forced or compulsory labor or human trafficking.\nFurthermore, our Business Partners do not mislead or defraud potential\nemployees about the nature of work, ask employees to pay recruitment fees\nor inappropriate transportation fees, and/or confiscate, destroy, conceal,\nand/or deny access to employee passports and other identity documents\nissued by government and/or restrict the employees’ freedom of movement\nor require employees to involuntarily use accommodation provided by the\ncompany for no operational reason.\n5\nEA-PU-xx-F-75, Rev. 0.1, 18-Nov-2024",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 5,
      "type": "text",
      "extraction_method": "pdfplumber",
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "FLOWCHART / PROCESS DIAGRAM:\n\nProcess Steps:\n  1. 1.8. Product  compliance and safety\n  2. Our Business Partners ensure the conformity and safety of their products\n  3. with applicable laws and regulations.\n  4. 1.9\n  5. Financial responsibility and accounting\n  6. Our Business Partners keep accurate records of their business expenditures\n  7. and never conceal the true nature of an expense. Business Partners should\n  8. perform their business dealings in a transparent manner and accurately\n  9. reflect them in the companies’ financial reports and filings. Business Partners\n  10. should confirm an adequate financial reporting system control is in place.\n  11. 2. Social responsibility and respect of human rights\n  12. For Yazaki (Yazaki EMEA), the social responsibility and especially the respect for internationally\n  13. recognized human rights as included in the International Bill of Human Rights, the\n  14. UN Guiding Principles on Business and Human Rights, the OECD Guidelines for\n  15. Multinational Enterprises, the ILO Core Labor Standards, the principles of the UN\n  16. Global Compact as well as the applicable supply chain legislation form the basis\n  17. for all our business relationships.\n  18. 2.1. Human rights\n  19. Our Business Partners respect these internationally recognized human rights,\n  20. and actively protect those rights of individuals or groups, irrespective of their\n  21. nationality, place of residence, sex, national or ethnic origin, color, religion,\n  22. or any other status.\n  23. 2.2\n  24. Prohibition of child labor and rights of young workers\n  25. Our Business Partners do not tolerate child labor within their own operations\n  26. or within its direct suppliers. They ensure that they do not employ directly or\n  27. indirectly persons under the applicable legal minimum working age. They\n  28. also respect all regulations for the protection of employees under the age of\n  29. 18.\n  30. 2.3\n  31. Prohibition of modern slavery, forced labor and unethical recruiting\n  32. Our Business Partners do not tolerate the use of any kind of slavery,\n  33. servitude, forced or compulsory labor or human trafficking.\n  34. Furthermore, our Business Partners do not mislead or defraud potential\n  35. employees about the nature of work, ask employees to pay recruitment fees\n  36. or inappropriate transportation fees, and/or confiscate, destroy, conceal,\n  37. and/or deny access to employee passports and other identity documents\n  38. issued by government and/or restrict the employees’ freedom of movement\n  39. or require employees to involuntarily use accommodation provided by the\n  40. company for no operational reason.\n  41. EA-PU-xx-F-75, Rev. 0:1, 18-Nov-2024\n\nTotal steps identified: 41",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 5,
      "type": "flowchart",
      "image_index": null,
      "extraction_method": "flowchart_ocr",
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "2.4. Working hours\nOur Business Partners ensure that they comply with all applicable regulations\non working hours including overtime, maximum hours, and rest periods, with\na maximum of 48 hours per regular workweek with a rest period of at least\n24 consecutive hours every seven days shall apply to prevent excessive\nphysical and mental fatigue.\n2.5. Freedom of association and collective bargaining\nOur Business Partners respect the rights of all employees to form and join\ntrade unions and employee representations, and to engage in collective\nbargaining and strikes. This precludes any form of discrimination or retaliatory\nmeasures based on union activities. Even in case such rights are restricted or\nnot provided at all by local law, our Business Partners ensure that the\nconcerns of their employees are heard and considered without fear of\nintimidation, harassment or retaliation.\n2.6. Non-discrimination\nYazaki (Yazaki EMEA) expects that its Business Partners respect the basic rights of\nemployees and treat them fairly, promote diversity, equity and inclusion, and\nprovide equal opportunities to all their employees, in particular, the payment\nof equal remuneration for work of equal value.\nOur Business Partners ensure that their working environment is free from\nretaliation, discrimination, intimidation, harassment or any other improper\nconduct, for example based on ethnic decent, origin, nationality, religion,\nideology, gender, sexual orientation, gender identity, age, disability, medical\ncondition, race, color or their social background or any other characteristics.\n2.7. Health and safety\nOur Business Partners provide sufficient processes, resources and standards\nto set up a management system assuring compliance with all applicable\noccupational health, safety, and fire safety legislation. They ensure that\nregular risk assessments, reporting and training of their employees are\nperformed to prevent any accidents and occupational diseases from\noccurring, according to ISO (International Organization for Standardization) 45001 or similar auditable standard.\n2.8. Wages and benefits\nOur Business Partners pay at least an adequate living wage, which amounts\nto at least the minimum wage as laid down by the applicable law and, apart\nfrom that, is determined in accordance with the regulations of the place of\nemployment that ensures an appropriate standard of living for their\nemployees and their families.\n6\nEA-PU-xx-F-75, Rev. 0.1, 18-Nov-2024",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 6,
      "type": "text",
      "extraction_method": "pdfplumber",
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "FLOWCHART / PROCESS DIAGRAM:\n\nProcess Steps:\n  1. 2.4. Working hours\n  2. Our Business Partners ensure that they comply with all applicable regulations\n  3. on working hours including overtime, maximum hours, and rest periods, with\n  4. a maximum of 48 hours per regular workweek with a rest period of at least\n  5. 24 consecutive hours every seven days shall apply to prevent excessive\n  6. physical and mental fatigue.\n  7. 2.5. Freedom of association and collective bargaining\n  8. Our Business Partners respect the rights of all employees to form and join\n  9. trade unions and employee representations, and to engage in collective\n  10. bargaining and strikes. This precludes any form of discrimination or retaliatory\n  11. measures based on union activities. Even in case such rights are restricted or\n  12. not provided at all by local law, our Business Partners ensure that the\n  13. concerns of their employees are heard and considered without fear of\n  14. intimidation, harassment or retaliation.\n  15. 2.6. Non-discrimination\n  16. Yazaki (Yazaki EMEA) expects that its Business Partners respect the basic rights of\n  17. employees and treat them fairly, promote diversity, equity and inclusion, and\n  18. provide equal opportunities to all their employees, in particular, the payment\n  19. of equal remuneration for work of equal value.\n  20. Our Business Partners ensure that their working environment is free from\n  21. retaliation, discrimination, intimidation, harassment or any other improper\n  22. conduct, for example based on ethnic decent, origin, nationality, religion,\n  23. ideology, gender, sexual orientation, gender identity, age, disability, medical\n  24. condition, race, color or their social background or any other characteristics.\n  25. 2.7\n  26. Health and safety\n  27. Our Business Partners provide sufficient processes, resources and standards\n  28. to set up a management system assuring compliance with all applicable\n  29. occupational health, safety, and fire safety legislation. They ensure that\n  30. regular risk assessments, reporting and training of their employees are\n  31. performed to prevent any accidents and occupational diseases from\n  32. occurring, according to ISO (International Organization for Standardization) 45001 or similar auditable standard.\n  33. 2.8\n  34. Wages and benefits\n  35. Our Business Partners pay at least an adequate living wage, which amounts\n  36. to at least the minimum wage as laid down by the applicable law and, apart\n  37. from that, is determined in accordance with the regulations of the place of\n  38. employment that ensures an appropriate standard of living for their\n  39. employees and their families.\n  40. EA-PU-xx-F-75, Rev. 0:1, 18-Nov-2024\n\nTotal steps identified: 40",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 6,
      "type": "flowchart",
      "image_index": null,
      "extraction_method": "flowchart_ocr",
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "2.9. Conflict minerals\nOur Business Partners must ensure that they comply with all applicable\nsupply chain due diligence obligations for the sourcing of raw materials, in\nparticular conflict minerals (e.g., tin, tantalum, tungsten and gold, as\nprovided in the Dodd-Frank Wall Street Reform Act, Sect. 1502, the\nRegulation (EU) 2017/821 and other similar legislations).\n2.10. No forced eviction, respect of land, forest and water rights\nOur Business Partners also comply with the prohibition of unlawful eviction\nand deprivation of land, forests and waters that serve as a person’s livelihood\nduring the whole production cycle.\n2.11. Community engagement\nYazaki (Yazaki EMEA) cooperates with Business Partners who respect the rights, the\nlivelihoods, the cultures and traditions of local communities in each country\nwhere they operate. We encourage our Business Partners to engage with the\nlocal communities, to identify their needs and support economic\ndevelopment, and to further contribute towards sustainability and deliver\npositive social impact.\n2.12. Vulnerable groups\nOur Business Partners respect the rights of minorities, indigenous people,\nwomen, children, human right defenders and other vulnerable groups and\nstrive to avoid any negative impact on them. In particular, our Business\nPartners comply with the principles of free, prior, and informed consent of\nindigenous peoples in its activities in connection with their land and its\ncultivation as well as other natural resources.\n2.13. Use of private or public security forces\nOur Business Partners ensure that the use of private or public security forces\ndoes not lead to violations of human rights, in particular to torture and cruel,\ninhuman, or degrading treatment, damages to life or limb or to the\nimpairment of the freedom of association. The Business Partners ensure as\nwell not to contribute directly or indirectly to supporting private or public\nsecurity forces that unlawfully exercise control over mining sites,\ntransportation routes and upstream stakeholders in the supply chain.\n7\nEA-PU-xx-F-75, Rev. 0.1, 18-Nov-2024",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 7,
      "type": "text",
      "extraction_method": "pdfplumber",
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "FLOWCHART / PROCESS DIAGRAM:\n\nProcess Steps:\n  1. 2.9. Conflict minerals\n  2. Our Business Partners must ensure that they comply with all applicable\n  3. supply chain due diligence obligations for the sourcing of raw materials, in\n  4. particular conflict minerals (e.g., tin, tantalum, tungsten and gold, as\n  5. provided in the Dodd-Frank Wall Street Reform Act, Sect. 1502, the\n  6. Regulation (EU) 2017/821 and other similar legislations).\n  7. 2.10. No forced eviction, respect of land, forest and water rights\n  8. Our Business Partners also comply with the prohibition of unlawful eviction\n  9. and deprivation of land, forests and waters that serve as a person’s livelihood\n  10. during the whole production cycle.\n  11. 2.11. Community engagement\n  12. Yazaki (Yazaki EMEA) cooperates with Business Partners who respect the rights, the\n  13. livelihoods, the cultures and traditions of local communities in each country\n  14. where they operate. We encourage our Business Partners to engage with the\n  15. local\n  16. communities,\n  17. to\n  18. identify their\n  19. needs and support economic\n  20. development, and to further contribute towards sustainability and deliver\n  21. positive social impact.\n  22. 2.12. Vulnerable groups\n  23. Our Business Partners respect the rights of minorities, indigenous people,\n  24. women, children, human right defenders and other vulnerable groups and\n  25. strive to avoid any negative impact on them. In particular, our Business\n  26. Partners comply with the principles of free, prior, and informed consent of\n  27. indigenous peoples in its activities in connection with their land and its\n  28. cultivation as well as other natural resources.\n  29. 2.13. Use of private or public security forces\n  30. Our Business Partners ensure that the use of private or public security forces\n  31. does not lead to violations of human rights, in particular to torture and cruel,\n  32. inhuman, or degrading treatment, damages to life or limb or to the\n  33. impairment of the freedom of association. The Business Partners ensure as\n  34. well not to contribute directly or indirectly to supporting private or public\n  35. security forces that unlawfully exercise control\n  36. over\n  37. mining sites,\n  38. transportation routes and upstream stakeholders in the supply chain.\n  39. EA-PU-xx-F-75, Rev. 0:1, 18-Nov-2024\n\nTotal steps identified: 39",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 7,
      "type": "flowchart",
      "image_index": null,
      "extraction_method": "flowchart_ocr",
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "3. Your responsibility for the protection of the environment\nYazaki (Yazaki EMEA) is committed to preserving the environment and its resources for current\nand future generations. Yazaki (Yazaki EMEA)’s goals and continuous progress are shared and\ncommunicated in the annual Sustainability Report published on www.yazaki-\neurope.com\n3.1. General expectations regarding environment\nOur Business Partners set up a management system assuring compliance\nwith existing legislation and Yazaki (Yazaki EMEA)’s requirements regarding the protection\nof the environment. They adopt effective environmental policies, establish\nadequate environmental objectives and targets to eliminate and/or minimize\nnegative environmental impacts. Furthermore, they define, implement and\nmonitor dedicated action plans, to educate their employees, and to make\ncontinuous efforts to reduce the impact of their footprint on the\nenvironment.\nOur Business Partners support Yazaki (Yazaki EMEA)’s vision on sustainability throughout\nthe supply chain by implementing a sustainable and efficient resource\nmanagement system and contributing to circular economy, including:\n• use of sustainable, recycled and renewable natural resources,\n• reduction of waste production and increase of waste reuse and recycling,\n• protection of air quality and minimization of air emissions,\n• increasing energy efficiency and the use of renewable energy where\navailable,\n• reducing single use plastic,\n• responsible chemical management including the administration of\nenvironmentally hazardous substances,\n• avoiding any harmful soil change, water pollution, air pollution, harmful\nnoise emission or excessive water consumption that significantly impairs\nthe natural bases for the preservation and production of food, denies a\nperson access to safe and clean drinking water, makes it difficult for a\nperson to access sanitary facilities or destroys them or harms the health\nof a person.\n3.2. Environment product compliance\nOur Business Partners comply with all applicable laws and regulations\nconcerning hazardous materials, chemicals and substances that apply to the\nrelevant market and/or the business location (e.g. the EU REACH (Registration, Evaluation, Authorization and Restriction of Chemicals) Regulation,\nthe Minamata Convention on Mercury, the Stockholm Convention on\nPersistent Organic Pollutants and the Basel Convention on the Control of\nTransboundary Movements of Hazardous Waste and their Disposal).\n8\nEA-PU-xx-F-75, Rev. 0.1, 18-Nov-2024",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 8,
      "type": "text",
      "extraction_method": "pdfplumber",
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "Our Business Partners provide products that are fully compliant with all\napplicable environmental product compliance legislation.\n3.3. Carbon neutrality and GHG emissions reporting\nYazaki (Yazaki EMEA) strives towards achieving carbon neutrality and requires its Business\nPartners to ensure that their business model and strategy are aligned with\nthe objectives of the transition to a sustainable economy in line with the Paris\nAgreement and the objective of achieving climate neutrality and being\navailable to disclose information regarding environmental impacts, including\nbut not limited to decarbonization performance.\nOur Business Partners provide information on request in relation to the\noverall energy consumption and carbon emissions (scope 1, 2 and 3, in\naccordance with GHG protocol).\n3.4. Protection of biodiversity\nOur Business Partners preserve the global environment and its resources.\nThey protect natural ecosystems, especially key biodiversity areas impacted\nby their operations, and avoid illegal deforestation and adverse land use\nleading to reduction of soil quality in accordance with the applicable\nbiodiversity regulations.\n3.5. Animal welfare\nOur Business Partners support animal welfare and promote ethical\ntreatment of animals.\n4. Your responsibility for the compliance with this Code\nYazaki (Yazaki EMEA) considers compliance with the provisions of this Code as essential for\nany business relationship with its Business Partners. Therefore, our Business\nPartners support Yazaki (Yazaki EMEA) and share this responsibility.\n4.1. Continuous improvement\nThis Code provides for the expectations and minimum requirements which\nBusiness Partners must meet. Yazaki (Yazaki EMEA) expects Business Partners to exceed\nthose minimum standards, and to strive to meet the industry best practices.\nYazaki (Yazaki EMEA) recognizes that the latter is a dynamic process and encourages\nBusiness Partners to continually improve and adapt.\n4.2. Passing on the requirements of this Code along the supply chain\nOur Business Partners make their employees and business partners familiar\nwith the requirements of this Code. Our Business Partners pass on these\nprinciples and the related obligations to their business partners as well.\n9\nEA-PU-xx-F-75, Rev. 0.1, 18-Nov-2024",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 9,
      "type": "text",
      "extraction_method": "pdfplumber",
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "FLOWCHART / PROCESS DIAGRAM:\n\nProcess Steps:\n  1. Our Business Partners provide products that are fully compliant with all\n  2. applicable environmental product compliance legislation.\n  3. 3.3\n  4. Carbon neutrality and GHG emissions reporting\n  5. Yazaki (Yazaki EMEA) strives towards achieving carbon neutrality and requires its Business\n  6. Partners to ensure that their business model and strategy are aligned with\n  7. the objectives of the transition to a sustainable economy in line with the Paris\n  8. Agreement and the objective of achieving climate neutrality and being\n  9. available to disclose information regarding environmental impacts, including\n  10. but not limited to decarbonization performance.\n  11. Our Business Partners provide information on request in relation to the\n  12. overall energy consumption and carbon emissions (scope 1, 2 and 3, in\n  13. accordance with GHG protocol).\n  14. 3.4\n  15. Protection of biodiversity\n  16. Our Business Partners preserve the global environment and its resources.\n  17. They protect natural ecosystems, especially key biodiversity areas impacted\n  18. by their operations, and avoid illegal deforestation and adverse land use\n  19. leading to reduction of soil quality in accordance with the applicable\n  20. biodiversity regulations.\n  21. 3.5\n  22. Animal welfare\n  23. Our Business Partners support animal welfare and promote ethical\n  24. treatment of animals.\n  25. 4. Your responsibility for the compliance with this Code\n  26. Yazaki (Yazaki EMEA) considers compliance with the provisions of this Code as essential for\n  27. any business relationship with its Business Partners. Therefore, our Business\n  28. Partners support Yazaki (Yazaki EMEA) and share this responsibility.\n  29. 4.1\n  30. Continuous improvement\n  31. This Code provides for the expectations and minimum requirements which\n  32. Business Partners must meet. Yazaki (Yazaki EMEA) expects Business Partners to exceed\n  33. those minimum standards, and to strive to meet the industry best practices.\n  34. Yazaki (Yazaki EMEA) recognizes that the latter is a dynamic process and encourages\n  35. Business Partners to continually improve and adapt.\n  36. 4.2\n  37. Passing on the requirements of this Code along the supply chain\n  38. Our Business Partners make their employees and business partners familiar\n  39. with the requirements of this Code. Our Business Partners pass on these\n  40. principles and the related obligations to their business partners as well.\n  41. EA-PU-xx-F-75, Rev. 0:1, 18-Nov-2024\n\nTotal steps identified: 41",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 9,
      "type": "flowchart",
      "image_index": null,
      "extraction_method": "flowchart_ocr",
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "4.3. Monitoring\nOur Business Partners establish and maintain processes that identify and\neliminate risks arising from non-compliance with this Code.\n4.4. Disclosure of information and audit right\nBusiness Partners record information regarding their business activities,\nworking methods, health, safety, environmental practices and other matters\nnamed in this Code. At any point of its relationship with them, Yazaki (Yazaki EMEA) may\nask its Business Partners for confirmation and verification of compliance with\nthis Code, insofar as the disclosure does not violate legal requirements.\nIf the Business Partners identify any potential violation of these obligations,\nthey immediately inform Yazaki (Yazaki EMEA) and initiate adequate mitigation measures\nwithin a reasonable time. If such measures cannot end the violation in the\nforeseeable future, the Business Partners agree to draw up and implement,\njointly with Yazaki (Yazaki EMEA), a concept for ending or minimizing the violation without\nundue delay.\nYazaki (Yazaki EMEA) reserves the right to audit the Business Partners’ compliance with this\nCode in line with the applicable law, in an appropriate manner and at\nbusiness hours as mutually agreed with the respective Business Partner.\n4.5. Consequences in case of non-compliance\nIn case of non-compliance with any expectation or requirement as set out in\nthis Code, Yazaki (Yazaki EMEA) reserves the right to take appropriate legal action, including\nto claim damages. The same applies if a Business Partner fails or refuses to\nimplement measures for improving their sustainability performance.\nWithout prejudice to any further rights and subject to applicable law, Yazaki (Yazaki EMEA)\nreserves the right to terminate the business relationship in case of any\nmaterial breach of this Code.\n4.6. Whistleblowing and grievance mechanism, protection against retaliation\nOur Business Partners enable and encourage their employees and business\npartners to speak up in the event of non-compliance with the requirements\nof this Code.\nOur Business Partners, their employees and any other third parties can send\nus such reports via email to compliance@yazaki-europe.com or by using our\nwhistleblowing hotline which can be accessed at Yazaki (Yazaki EMEA) EMEA (Europe Middle East Africa) Speak-Up Line.\nAll reports will be treated confidentially.\nOur Business Partners prohibit and do not tolerate retaliation against any\nperson who reported in good faith non-compliance with the requirements of\nthis Code.\n10\nEA-PU-xx-F-75, Rev. 0.1, 18-Nov-2024",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 10,
      "type": "text",
      "extraction_method": "pdfplumber",
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "FLOWCHART / PROCESS DIAGRAM:\n\nProcess Steps:\n  1. 4.3. Monitoring\n  2. Our Business Partners establish and maintain processes that identify and\n  3. eliminate risks arising from non-compliance with this Code.\n  4. 4.4\n  5. Disclosure of information and audit right\n  6. Business Partners record information regarding their business activities,\n  7. working methods, health, safety, environmental practices and other matters\n  8. named in this Code. At any point of its relationship with them, Yazaki (Yazaki EMEA) may\n  9. ask its Business Partners for confirmation and verification of compliance with\n  10. this Code, insofar as the disclosure does not violate legal requirements.\n  11. If the Business Partners identify any potential violation of these obligations,\n  12. they immediately inform Yazaki (Yazaki EMEA) and initiate adequate mitigation measures\n  13. within a reasonable time. If such measures cannot end the violation in the\n  14. foreseeable future, the Business Partners agree to draw up and implement,\n  15. jointly with Yazaki (Yazaki EMEA), a concept for ending or minimizing the violation without\n  16. undue delay.\n  17. Yazaki (Yazaki EMEA) reserves the right to audit the Business Partners’ compliance with this\n  18. Code in line with the applicable law, in an appropriate manner and at\n  19. business hours as mutually agreed with the respective Business Partner.\n  20. 4.5\n  21. Consequences in case of non-compliance\n  22. In case of non-compliance with any expectation or requirement as set out in\n  23. this Code, Yazaki (Yazaki EMEA) reserves the right to take appropriate legal action, including\n  24. to claim damages. The same applies if a Business Partner fails or refuses to\n  25. implement measures for improving their sustainability performance.\n  26. Without prejudice to any further rights and subject to applicable law, Yazaki (Yazaki EMEA)\n  27. reserves the right to terminate the business relationship in case of any\n  28. material breach of this Code.\n  29. 4.6\n  30. Whistleblowing and grievance mechanism, protection against retaliation\n  31. Our Business Partners enable and encourage their employees and business\n  32. partners to speak up in the event of non-compliance with the requirements\n  33. of this Code.\n  34. Our Business Partners, their employees and any other third parties can send\n  35. us such reports via email to compliance@yazaki-europe.com or by using our\n  36. whistleblowing hotline which can be accessed at Yazaki (Yazaki EMEA) EMEA (Europe Middle East Africa) Speak-Up Line.\n  37. All reports will be treated confidentially.\n  38. Our Business Partners prohibit and do not tolerate retaliation against any\n  39. person who reported in good faith non-compliance with the requirements of\n  40. this Code.\n  41. 10\n  42. EA-PU-xx-F-75, Rev. 0:1, 18-Nov-2024\n\nTotal steps identified: 42",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 10,
      "type": "flowchart",
      "image_index": null,
      "extraction_method": "flowchart_ocr",
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "4.7. Additional information and support\nFor further information and guidance on this Code, Business Partners can\ncontact Yazaki (Yazaki EMEA)’s purchasing team via the supplier section on our homepage\n(https://www.yazaki-europe.com/supplier).\nWe hereby confirm that we understand, share, respect and adhere to the\nprovisions of this Code.\nCompany Name __________________________________________\nAddress: __________________________________________\nDate and Signature: __________________________________________\nFunction of Signee: __________________________________________\n11\nEA-PU-xx-F-75, Rev. 0.1, 18-Nov-2024",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 11,
      "type": "text",
      "extraction_method": "pdfplumber",
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "TABLE (AI-detected, scanned) on page 11:\nCompany Name\nAddress:\n\nDate and Signature:\nFunction of Signee:\n",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 11,
      "type": "table_scanned",
      "table_index": 0,
      "extraction_method": "ai_table_detector",
      "confidence": 0.6131302118301392,
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  },
  {
    "page_content": "TABLE (AI-detected, scanned) on page 11:\nmpany Name a\ndress:\n\nte and Signature:\n\nnction of Signee:\n",
    "metadata": {
      "source": "YAZAKI EMEA Business Partner Code of Conduct",
      "page": 11,
      "type": "table_scanned",
      "table_index": 1,
      "extraction_method": "ai_table_detector",
      "confidence": 0.9195196032524109,
      "filename": "YAZAKI EMEA Business Partner Code of Conduct"
    }
  }
]